MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
// Register: PWMTMRS
#define PWMTMRS PWMTMRS
extern volatile unsigned char           PWMTMRS             __at(0x61D);
#ifndef _LIB_BUILD
asm("PWMTMRS equ 061Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1TSEL                 :1;
        unsigned                        :1;
        unsigned P2TSEL                 :1;
    };
} PWMTMRSbits_t;
extern volatile PWMTMRSbits_t PWMTMRSbits __at(0x61D);
// bitfield macros
#define _PWMTMRS_P1TSEL_POSN                                0x0
#define _PWMTMRS_P1TSEL_POSITION                            0x0
#define _PWMTMRS_P1TSEL_SIZE                                0x1
#define _PWMTMRS_P1TSEL_LENGTH                              0x1
#define _PWMTMRS_P1TSEL_MASK                                0x1
#define _PWMTMRS_P2TSEL_POSN                                0x2
#define _PWMTMRS_P2TSEL_POSITION                            0x2
#define _PWMTMRS_P2TSEL_SIZE                                0x1
#define _PWMTMRS_P2TSEL_LENGTH                              0x1
#define _PWMTMRS_P2TSEL_MASK                                0x4

// Register: PWM1AOE
#define PWM1AOE PWM1AOE
extern volatile unsigned char           PWM1AOE             __at(0x61E);
#ifndef _LIB_BUILD
asm("PWM1AOE equ 061Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1OE                 :4;
    };
    struct {
        unsigned PWM1OE0                :1;
        unsigned PWM1OE1                :1;
        unsigned PWM1OE2                :1;
        unsigned PWM1OE3                :1;
    };
} PWM1AOEbits_t;
extern volatile PWM1AOEbits_t PWM1AOEbits __at(0x61E);
// bitfield macros
#define _PWM1AOE_PWM1OE_POSN                                0x0
#define _PWM1AOE_PWM1OE_POSITION                            0x0
#define _PWM1AOE_PWM1OE_SIZE                                0x4
#define _PWM1AOE_PWM1OE_LENGTH                              0x4
#define _PWM1AOE_PWM1OE_MASK                                0xF
#define _PWM1AOE_PWM1OE0_POSN                               0x0
#define _PWM1AOE_PWM1OE0_POSITION                           0x0
#define _PWM1AOE_PWM1OE0_SIZE                               0x1
#define _PWM1AOE_PWM1OE0_LENGTH                             0x1
#define _PWM1AOE_PWM1OE0_MASK                               0x1
#define _PWM1AOE_PWM1OE1_POSN                               0x1
#define _PWM1AOE_PWM1OE1_POSITION                           0x1
#define _PWM1AOE_PWM1OE1_SIZE                               0x1
#define _PWM1AOE_PWM1OE1_LENGTH                             0x1
#define _PWM1AOE_PWM1OE1_MASK                               0x2
#define _PWM1AOE_PWM1OE2_POSN                               0x2
#define _PWM1AOE_PWM1OE2_POSITION                           0x2
#define _PWM1AOE_PWM1OE2_SIZE                               0x1
#define _PWM1AOE_PWM1OE2_LENGTH                             0x1
#define _PWM1AOE_PWM1OE2_MASK                               0x4
#define _PWM1AOE_PWM1OE3_POSN                               0x3
#define _PWM1AOE_PWM1OE3_POSITION                           0x3
#define _PWM1AOE_PWM1OE3_SIZE                               0x1
#define _PWM1AOE_PWM1OE3_LENGTH                             0x1
#define _PWM1AOE_PWM1OE3_MASK                               0x8

// Register: PWM2AOE
#define PWM2AOE PWM2AOE
extern volatile unsigned char           PWM2AOE             __at(0x61F);
#ifndef _LIB_BUILD
asm("PWM2AOE equ 061Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2OE                 :4;
    };
    struct {
        unsigned PWM2OE0                :1;
        unsigned PWM2OE1                :1;
        unsigned PWM2OE2                :1;
        unsigned PWM2OE3                :1;
    };
} PWM2AOEbits_t;
extern volatile PWM2AOEbits_t PWM2AOEbits __at(0x61F);
// bitfield macros
#define _PWM2AOE_PWM2OE_POSN                                0x0
#define _PWM2AOE_PWM2OE_POSITION                            0x0
#define _PWM2AOE_PWM2OE_SIZE                                0x4
#define _PWM2AOE_PWM2OE_LENGTH                              0x4
#define _PWM2AOE_PWM2OE_MASK                                0xF
#define _PWM2AOE_PWM2OE0_POSN                               0x0
#define _PWM2AOE_PWM2OE0_POSITION                           0x0
#define _PWM2AOE_PWM2OE0_SIZE                               0x1
#define _PWM2AOE_PWM2OE0_LENGTH                             0x1
#define _PWM2AOE_PWM2OE0_MASK                               0x1
#define _PWM2AOE_PWM2OE1_POSN                               0x1
#define _PWM2AOE_PWM2OE1_POSITION                           0x1
#define _PWM2AOE_PWM2OE1_SIZE                               0x1
#define _PWM2AOE_PWM2OE1_LENGTH                             0x1
#define _PWM2AOE_PWM2OE1_MASK                               0x2
#define _PWM2AOE_PWM2OE2_POSN                               0x2
#define _PWM2AOE_PWM2OE2_POSITION                           0x2
#define _PWM2AOE_PWM2OE2_SIZE                               0x1
#define _PWM2AOE_PWM2OE2_LENGTH                             0x1
#define _PWM2AOE_PWM2OE2_MASK                               0x4
#define _PWM2AOE_PWM2OE3_POSN                               0x3
#define _PWM2AOE_PWM2OE3_POSITION                           0x3
#define _PWM2AOE_PWM2OE3_SIZE                               0x1
#define _PWM2AOE_PWM2OE3_LENGTH                             0x1
#define _PWM2AOE_PWM2OE3_MASK                               0x8

// Register: ADCTX
#define ADCTX ADCTX
extern volatile unsigned char           ADCTX               __at(0x691);
#ifndef _LIB_BUILD
asm("ADCTX equ 0691h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned A1TX0                  :1;
        unsigned A1TX1                  :1;
        unsigned A1TX2                  :1;
        unsigned                        :1;
        unsigned A2TX0                  :1;
        unsigned A2TX1                  :1;
        unsigned A2TX2                  :1;
    };
} ADCTXbits_t;
extern volatile ADCTXbits_t ADCTXbits __at(0x691);
// bitfield macros
#define _ADCTX_A1TX0_POSN                                   0x0
#define _ADCTX_A1TX0_POSITION                               0x0
#define _ADCTX_A1TX0_SIZE                                   0x1
#define _ADCTX_A1TX0_LENGTH                                 0x1
#define _ADCTX_A1TX0_MASK                                   0x1
#define _ADCTX_A1TX1_POSN                                   0x1
#define _ADCTX_A1TX1_POSITION                               0x1
#define _ADCTX_A1TX1_SIZE                                   0x1
#define _ADCTX_A1TX1_LENGTH                                 0x1
#define _ADCTX_A1TX1_MASK                                   0x2
#define _ADCTX_A1TX2_POSN                                   0x2
#define _ADCTX_A1TX2_POSITION                               0x2
#define _ADCTX_A1TX2_SIZE                                   0x1
#define _ADCTX_A1TX2_LENGTH                                 0x1
#define _ADCTX_A1TX2_MASK                                   0x4
#define _ADCTX_A2TX0_POSN                                   0x4
#define _ADCTX_A2TX0_POSITION                               0x4
#define _ADCTX_A2TX0_SIZE                                   0x1
#define _ADCTX_A2TX0_LENGTH                                 0x1
#define _ADCTX_A2TX0_MASK                                   0x10
#define _ADCTX_A2TX1_POSN                                   0x5
#define _ADCTX_A2TX1_POSITION                               0x5
#define _ADCTX_A2TX1_SIZE                                   0x1
#define _ADCTX_A2TX1_LENGTH                                 0x1
#define _ADCTX_A2TX1_MASK                                   0x20
#define _ADCTX_A2TX2_POSN                                   0x6
#define _ADCTX_A2TX2_POSITION                               0x6
#define _ADCTX_A2TX2_SIZE                                   0x1
#define _ADCTX_A2TX2_LENGTH                                 0x1
#define _ADCTX_A2TX2_MASK                                   0x40

// Register: AD1TX
#define AD1TX AD1TX
extern volatile unsigned short          AD1TX               __at(0x692);
#ifndef _LIB_BUILD
asm("AD1TX equ 0692h");
#endif
// aliases
extern volatile unsigned short          AAD1TX              __at(0x692);
#ifndef _LIB_BUILD
asm("AAD1TX equ 0692h");
#endif

