MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
// Register: AD1TX0
#define AD1TX0 AD1TX0
extern volatile unsigned char           AD1TX0              __at(0x692);
#ifndef _LIB_BUILD
asm("AD1TX0 equ 0692h");
#endif
// aliases
extern volatile unsigned char           AAD1TX0             __at(0x692);
#ifndef _LIB_BUILD
asm("AAD1TX0 equ 0692h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX10                   :1;
        unsigned TX11                   :1;
        unsigned TX12                   :1;
        unsigned TX13                   :1;
        unsigned TX14                   :1;
        unsigned TX15                   :1;
        unsigned TX16                   :1;
        unsigned TX17                   :1;
    };
} AD1TX0bits_t;
extern volatile AD1TX0bits_t AD1TX0bits __at(0x692);
// bitfield macros
#define _AD1TX0_TX10_POSN                                   0x0
#define _AD1TX0_TX10_POSITION                               0x0
#define _AD1TX0_TX10_SIZE                                   0x1
#define _AD1TX0_TX10_LENGTH                                 0x1
#define _AD1TX0_TX10_MASK                                   0x1
#define _AD1TX0_TX11_POSN                                   0x1
#define _AD1TX0_TX11_POSITION                               0x1
#define _AD1TX0_TX11_SIZE                                   0x1
#define _AD1TX0_TX11_LENGTH                                 0x1
#define _AD1TX0_TX11_MASK                                   0x2
#define _AD1TX0_TX12_POSN                                   0x2
#define _AD1TX0_TX12_POSITION                               0x2
#define _AD1TX0_TX12_SIZE                                   0x1
#define _AD1TX0_TX12_LENGTH                                 0x1
#define _AD1TX0_TX12_MASK                                   0x4
#define _AD1TX0_TX13_POSN                                   0x3
#define _AD1TX0_TX13_POSITION                               0x3
#define _AD1TX0_TX13_SIZE                                   0x1
#define _AD1TX0_TX13_LENGTH                                 0x1
#define _AD1TX0_TX13_MASK                                   0x8
#define _AD1TX0_TX14_POSN                                   0x4
#define _AD1TX0_TX14_POSITION                               0x4
#define _AD1TX0_TX14_SIZE                                   0x1
#define _AD1TX0_TX14_LENGTH                                 0x1
#define _AD1TX0_TX14_MASK                                   0x10
#define _AD1TX0_TX15_POSN                                   0x5
#define _AD1TX0_TX15_POSITION                               0x5
#define _AD1TX0_TX15_SIZE                                   0x1
#define _AD1TX0_TX15_LENGTH                                 0x1
#define _AD1TX0_TX15_MASK                                   0x20
#define _AD1TX0_TX16_POSN                                   0x6
#define _AD1TX0_TX16_POSITION                               0x6
#define _AD1TX0_TX16_SIZE                                   0x1
#define _AD1TX0_TX16_LENGTH                                 0x1
#define _AD1TX0_TX16_MASK                                   0x40
#define _AD1TX0_TX17_POSN                                   0x7
#define _AD1TX0_TX17_POSITION                               0x7
#define _AD1TX0_TX17_SIZE                                   0x1
#define _AD1TX0_TX17_LENGTH                                 0x1
#define _AD1TX0_TX17_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX10                   :1;
        unsigned TX11                   :1;
        unsigned TX12                   :1;
        unsigned TX13                   :1;
        unsigned TX14                   :1;
        unsigned TX15                   :1;
        unsigned TX16                   :1;
        unsigned TX17                   :1;
    };
} AAD1TX0bits_t;
extern volatile AAD1TX0bits_t AAD1TX0bits __at(0x692);
// bitfield macros
#define _AAD1TX0_TX10_POSN                                  0x0
#define _AAD1TX0_TX10_POSITION                              0x0
#define _AAD1TX0_TX10_SIZE                                  0x1
#define _AAD1TX0_TX10_LENGTH                                0x1
#define _AAD1TX0_TX10_MASK                                  0x1
#define _AAD1TX0_TX11_POSN                                  0x1
#define _AAD1TX0_TX11_POSITION                              0x1
#define _AAD1TX0_TX11_SIZE                                  0x1
#define _AAD1TX0_TX11_LENGTH                                0x1
#define _AAD1TX0_TX11_MASK                                  0x2
#define _AAD1TX0_TX12_POSN                                  0x2
#define _AAD1TX0_TX12_POSITION                              0x2
#define _AAD1TX0_TX12_SIZE                                  0x1
#define _AAD1TX0_TX12_LENGTH                                0x1
#define _AAD1TX0_TX12_MASK                                  0x4
#define _AAD1TX0_TX13_POSN                                  0x3
#define _AAD1TX0_TX13_POSITION                              0x3
#define _AAD1TX0_TX13_SIZE                                  0x1
#define _AAD1TX0_TX13_LENGTH                                0x1
#define _AAD1TX0_TX13_MASK                                  0x8
#define _AAD1TX0_TX14_POSN                                  0x4
#define _AAD1TX0_TX14_POSITION                              0x4
#define _AAD1TX0_TX14_SIZE                                  0x1
#define _AAD1TX0_TX14_LENGTH                                0x1
#define _AAD1TX0_TX14_MASK                                  0x10
#define _AAD1TX0_TX15_POSN                                  0x5
#define _AAD1TX0_TX15_POSITION                              0x5
#define _AAD1TX0_TX15_SIZE                                  0x1
#define _AAD1TX0_TX15_LENGTH                                0x1
#define _AAD1TX0_TX15_MASK                                  0x20
#define _AAD1TX0_TX16_POSN                                  0x6
#define _AAD1TX0_TX16_POSITION                              0x6
#define _AAD1TX0_TX16_SIZE                                  0x1
#define _AAD1TX0_TX16_LENGTH                                0x1
#define _AAD1TX0_TX16_MASK                                  0x40
#define _AAD1TX0_TX17_POSN                                  0x7
#define _AAD1TX0_TX17_POSITION                              0x7
#define _AAD1TX0_TX17_SIZE                                  0x1
#define _AAD1TX0_TX17_LENGTH                                0x1
#define _AAD1TX0_TX17_MASK                                  0x80

// Register: AD1TX1
#define AD1TX1 AD1TX1
extern volatile unsigned char           AD1TX1              __at(0x693);
#ifndef _LIB_BUILD
asm("AD1TX1 equ 0693h");
#endif
// aliases
extern volatile unsigned char           AAD1TX1             __at(0x693);
#ifndef _LIB_BUILD
asm("AAD1TX1 equ 0693h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX18                   :1;
        unsigned TX19                   :1;
        unsigned TX30                   :1;
        unsigned TX31                   :1;
        unsigned TX32                   :1;
        unsigned TX33                   :1;
        unsigned TX34                   :1;
        unsigned TX35                   :1;
    };
} AD1TX1bits_t;
extern volatile AD1TX1bits_t AD1TX1bits __at(0x693);
// bitfield macros
#define _AD1TX1_TX18_POSN                                   0x0
#define _AD1TX1_TX18_POSITION                               0x0
#define _AD1TX1_TX18_SIZE                                   0x1
#define _AD1TX1_TX18_LENGTH                                 0x1
#define _AD1TX1_TX18_MASK                                   0x1
#define _AD1TX1_TX19_POSN                                   0x1
#define _AD1TX1_TX19_POSITION                               0x1
#define _AD1TX1_TX19_SIZE                                   0x1
#define _AD1TX1_TX19_LENGTH                                 0x1
#define _AD1TX1_TX19_MASK                                   0x2
#define _AD1TX1_TX30_POSN                                   0x2
#define _AD1TX1_TX30_POSITION                               0x2
#define _AD1TX1_TX30_SIZE                                   0x1
#define _AD1TX1_TX30_LENGTH                                 0x1
#define _AD1TX1_TX30_MASK                                   0x4
#define _AD1TX1_TX31_POSN                                   0x3
#define _AD1TX1_TX31_POSITION                               0x3
#define _AD1TX1_TX31_SIZE                                   0x1
#define _AD1TX1_TX31_LENGTH                                 0x1
#define _AD1TX1_TX31_MASK                                   0x8
#define _AD1TX1_TX32_POSN                                   0x4
#define _AD1TX1_TX32_POSITION                               0x4
#define _AD1TX1_TX32_SIZE                                   0x1
#define _AD1TX1_TX32_LENGTH                                 0x1
#define _AD1TX1_TX32_MASK                                   0x10
#define _AD1TX1_TX33_POSN                                   0x5
#define _AD1TX1_TX33_POSITION                               0x5
#define _AD1TX1_TX33_SIZE                                   0x1
#define _AD1TX1_TX33_LENGTH                                 0x1
#define _AD1TX1_TX33_MASK                                   0x20
#define _AD1TX1_TX34_POSN                                   0x6
#define _AD1TX1_TX34_POSITION                               0x6
#define _AD1TX1_TX34_SIZE                                   0x1
#define _AD1TX1_TX34_LENGTH                                 0x1
#define _AD1TX1_TX34_MASK                                   0x40
#define _AD1TX1_TX35_POSN                                   0x7
#define _AD1TX1_TX35_POSITION                               0x7
#define _AD1TX1_TX35_SIZE                                   0x1
#define _AD1TX1_TX35_LENGTH                                 0x1
#define _AD1TX1_TX35_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX18                   :1;
        unsigned TX19                   :1;
        unsigned TX30                   :1;
        unsigned TX31                   :1;
        unsigned TX32                   :1;
        unsigned TX33                   :1;
        unsigned TX34                   :1;
        unsigned TX35                   :1;
    };
} AAD1TX1bits_t;
