MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile AAD1TX1bits_t AAD1TX1bits __at(0x693);
// bitfield macros
#define _AAD1TX1_TX18_POSN                                  0x0
#define _AAD1TX1_TX18_POSITION                              0x0
#define _AAD1TX1_TX18_SIZE                                  0x1
#define _AAD1TX1_TX18_LENGTH                                0x1
#define _AAD1TX1_TX18_MASK                                  0x1
#define _AAD1TX1_TX19_POSN                                  0x1
#define _AAD1TX1_TX19_POSITION                              0x1
#define _AAD1TX1_TX19_SIZE                                  0x1
#define _AAD1TX1_TX19_LENGTH                                0x1
#define _AAD1TX1_TX19_MASK                                  0x2
#define _AAD1TX1_TX30_POSN                                  0x2
#define _AAD1TX1_TX30_POSITION                              0x2
#define _AAD1TX1_TX30_SIZE                                  0x1
#define _AAD1TX1_TX30_LENGTH                                0x1
#define _AAD1TX1_TX30_MASK                                  0x4
#define _AAD1TX1_TX31_POSN                                  0x3
#define _AAD1TX1_TX31_POSITION                              0x3
#define _AAD1TX1_TX31_SIZE                                  0x1
#define _AAD1TX1_TX31_LENGTH                                0x1
#define _AAD1TX1_TX31_MASK                                  0x8
#define _AAD1TX1_TX32_POSN                                  0x4
#define _AAD1TX1_TX32_POSITION                              0x4
#define _AAD1TX1_TX32_SIZE                                  0x1
#define _AAD1TX1_TX32_LENGTH                                0x1
#define _AAD1TX1_TX32_MASK                                  0x10
#define _AAD1TX1_TX33_POSN                                  0x5
#define _AAD1TX1_TX33_POSITION                              0x5
#define _AAD1TX1_TX33_SIZE                                  0x1
#define _AAD1TX1_TX33_LENGTH                                0x1
#define _AAD1TX1_TX33_MASK                                  0x20
#define _AAD1TX1_TX34_POSN                                  0x6
#define _AAD1TX1_TX34_POSITION                              0x6
#define _AAD1TX1_TX34_SIZE                                  0x1
#define _AAD1TX1_TX34_LENGTH                                0x1
#define _AAD1TX1_TX34_MASK                                  0x40
#define _AAD1TX1_TX35_POSN                                  0x7
#define _AAD1TX1_TX35_POSITION                              0x7
#define _AAD1TX1_TX35_SIZE                                  0x1
#define _AAD1TX1_TX35_LENGTH                                0x1
#define _AAD1TX1_TX35_MASK                                  0x80

// Register: AD2TX
#define AD2TX AD2TX
extern volatile unsigned short          AD2TX               __at(0x694);
#ifndef _LIB_BUILD
asm("AD2TX equ 0694h");
#endif
// aliases
extern volatile unsigned short          AAD2TX              __at(0x694);
#ifndef _LIB_BUILD
asm("AAD2TX equ 0694h");
#endif

// Register: AD2TX0
#define AD2TX0 AD2TX0
extern volatile unsigned char           AD2TX0              __at(0x694);
#ifndef _LIB_BUILD
asm("AD2TX0 equ 0694h");
#endif
// aliases
extern volatile unsigned char           AAD2TX0             __at(0x694);
#ifndef _LIB_BUILD
asm("AAD2TX0 equ 0694h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX20                   :1;
        unsigned TX21                   :1;
        unsigned TX22                   :1;
        unsigned TX23                   :1;
        unsigned TX24                   :1;
        unsigned TX25                   :1;
        unsigned TX26                   :1;
        unsigned TX27                   :1;
    };
} AD2TX0bits_t;
extern volatile AD2TX0bits_t AD2TX0bits __at(0x694);
// bitfield macros
#define _AD2TX0_TX20_POSN                                   0x0
#define _AD2TX0_TX20_POSITION                               0x0
#define _AD2TX0_TX20_SIZE                                   0x1
#define _AD2TX0_TX20_LENGTH                                 0x1
#define _AD2TX0_TX20_MASK                                   0x1
#define _AD2TX0_TX21_POSN                                   0x1
#define _AD2TX0_TX21_POSITION                               0x1
#define _AD2TX0_TX21_SIZE                                   0x1
#define _AD2TX0_TX21_LENGTH                                 0x1
#define _AD2TX0_TX21_MASK                                   0x2
#define _AD2TX0_TX22_POSN                                   0x2
#define _AD2TX0_TX22_POSITION                               0x2
#define _AD2TX0_TX22_SIZE                                   0x1
#define _AD2TX0_TX22_LENGTH                                 0x1
#define _AD2TX0_TX22_MASK                                   0x4
#define _AD2TX0_TX23_POSN                                   0x3
#define _AD2TX0_TX23_POSITION                               0x3
#define _AD2TX0_TX23_SIZE                                   0x1
#define _AD2TX0_TX23_LENGTH                                 0x1
#define _AD2TX0_TX23_MASK                                   0x8
#define _AD2TX0_TX24_POSN                                   0x4
#define _AD2TX0_TX24_POSITION                               0x4
#define _AD2TX0_TX24_SIZE                                   0x1
#define _AD2TX0_TX24_LENGTH                                 0x1
#define _AD2TX0_TX24_MASK                                   0x10
#define _AD2TX0_TX25_POSN                                   0x5
#define _AD2TX0_TX25_POSITION                               0x5
#define _AD2TX0_TX25_SIZE                                   0x1
#define _AD2TX0_TX25_LENGTH                                 0x1
#define _AD2TX0_TX25_MASK                                   0x20
#define _AD2TX0_TX26_POSN                                   0x6
#define _AD2TX0_TX26_POSITION                               0x6
#define _AD2TX0_TX26_SIZE                                   0x1
#define _AD2TX0_TX26_LENGTH                                 0x1
#define _AD2TX0_TX26_MASK                                   0x40
#define _AD2TX0_TX27_POSN                                   0x7
#define _AD2TX0_TX27_POSITION                               0x7
#define _AD2TX0_TX27_SIZE                                   0x1
#define _AD2TX0_TX27_LENGTH                                 0x1
#define _AD2TX0_TX27_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX20                   :1;
        unsigned TX21                   :1;
        unsigned TX22                   :1;
        unsigned TX23                   :1;
        unsigned TX24                   :1;
        unsigned TX25                   :1;
        unsigned TX26                   :1;
        unsigned TX27                   :1;
    };
} AAD2TX0bits_t;
