MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile AAD2TX0bits_t AAD2TX0bits __at(0x694);
// bitfield macros
#define _AAD2TX0_TX20_POSN                                  0x0
#define _AAD2TX0_TX20_POSITION                              0x0
#define _AAD2TX0_TX20_SIZE                                  0x1
#define _AAD2TX0_TX20_LENGTH                                0x1
#define _AAD2TX0_TX20_MASK                                  0x1
#define _AAD2TX0_TX21_POSN                                  0x1
#define _AAD2TX0_TX21_POSITION                              0x1
#define _AAD2TX0_TX21_SIZE                                  0x1
#define _AAD2TX0_TX21_LENGTH                                0x1
#define _AAD2TX0_TX21_MASK                                  0x2
#define _AAD2TX0_TX22_POSN                                  0x2
#define _AAD2TX0_TX22_POSITION                              0x2
#define _AAD2TX0_TX22_SIZE                                  0x1
#define _AAD2TX0_TX22_LENGTH                                0x1
#define _AAD2TX0_TX22_MASK                                  0x4
#define _AAD2TX0_TX23_POSN                                  0x3
#define _AAD2TX0_TX23_POSITION                              0x3
#define _AAD2TX0_TX23_SIZE                                  0x1
#define _AAD2TX0_TX23_LENGTH                                0x1
#define _AAD2TX0_TX23_MASK                                  0x8
#define _AAD2TX0_TX24_POSN                                  0x4
#define _AAD2TX0_TX24_POSITION                              0x4
#define _AAD2TX0_TX24_SIZE                                  0x1
#define _AAD2TX0_TX24_LENGTH                                0x1
#define _AAD2TX0_TX24_MASK                                  0x10
#define _AAD2TX0_TX25_POSN                                  0x5
#define _AAD2TX0_TX25_POSITION                              0x5
#define _AAD2TX0_TX25_SIZE                                  0x1
#define _AAD2TX0_TX25_LENGTH                                0x1
#define _AAD2TX0_TX25_MASK                                  0x20
#define _AAD2TX0_TX26_POSN                                  0x6
#define _AAD2TX0_TX26_POSITION                              0x6
#define _AAD2TX0_TX26_SIZE                                  0x1
#define _AAD2TX0_TX26_LENGTH                                0x1
#define _AAD2TX0_TX26_MASK                                  0x40
#define _AAD2TX0_TX27_POSN                                  0x7
#define _AAD2TX0_TX27_POSITION                              0x7
#define _AAD2TX0_TX27_SIZE                                  0x1
#define _AAD2TX0_TX27_LENGTH                                0x1
#define _AAD2TX0_TX27_MASK                                  0x80

// Register: AD2TX1
#define AD2TX1 AD2TX1
extern volatile unsigned char           AD2TX1              __at(0x695);
#ifndef _LIB_BUILD
asm("AD2TX1 equ 0695h");
#endif
// aliases
extern volatile unsigned char           AAD2TX1             __at(0x695);
#ifndef _LIB_BUILD
asm("AAD2TX1 equ 0695h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX28                   :1;
        unsigned TX29                   :1;
        unsigned TX40                   :1;
        unsigned TX41                   :1;
        unsigned TX42                   :1;
        unsigned TX43                   :1;
        unsigned TX44                   :1;
        unsigned TX45                   :1;
    };
} AD2TX1bits_t;
extern volatile AD2TX1bits_t AD2TX1bits __at(0x695);
// bitfield macros
#define _AD2TX1_TX28_POSN                                   0x0
#define _AD2TX1_TX28_POSITION                               0x0
#define _AD2TX1_TX28_SIZE                                   0x1
#define _AD2TX1_TX28_LENGTH                                 0x1
#define _AD2TX1_TX28_MASK                                   0x1
#define _AD2TX1_TX29_POSN                                   0x1
#define _AD2TX1_TX29_POSITION                               0x1
#define _AD2TX1_TX29_SIZE                                   0x1
#define _AD2TX1_TX29_LENGTH                                 0x1
#define _AD2TX1_TX29_MASK                                   0x2
#define _AD2TX1_TX40_POSN                                   0x2
#define _AD2TX1_TX40_POSITION                               0x2
#define _AD2TX1_TX40_SIZE                                   0x1
#define _AD2TX1_TX40_LENGTH                                 0x1
#define _AD2TX1_TX40_MASK                                   0x4
#define _AD2TX1_TX41_POSN                                   0x3
#define _AD2TX1_TX41_POSITION                               0x3
#define _AD2TX1_TX41_SIZE                                   0x1
#define _AD2TX1_TX41_LENGTH                                 0x1
#define _AD2TX1_TX41_MASK                                   0x8
#define _AD2TX1_TX42_POSN                                   0x4
#define _AD2TX1_TX42_POSITION                               0x4
#define _AD2TX1_TX42_SIZE                                   0x1
#define _AD2TX1_TX42_LENGTH                                 0x1
#define _AD2TX1_TX42_MASK                                   0x10
#define _AD2TX1_TX43_POSN                                   0x5
#define _AD2TX1_TX43_POSITION                               0x5
#define _AD2TX1_TX43_SIZE                                   0x1
#define _AD2TX1_TX43_LENGTH                                 0x1
#define _AD2TX1_TX43_MASK                                   0x20
#define _AD2TX1_TX44_POSN                                   0x6
#define _AD2TX1_TX44_POSITION                               0x6
#define _AD2TX1_TX44_SIZE                                   0x1
#define _AD2TX1_TX44_LENGTH                                 0x1
#define _AD2TX1_TX44_MASK                                   0x40
#define _AD2TX1_TX45_POSN                                   0x7
#define _AD2TX1_TX45_POSITION                               0x7
#define _AD2TX1_TX45_SIZE                                   0x1
#define _AD2TX1_TX45_LENGTH                                 0x1
#define _AD2TX1_TX45_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX28                   :1;
        unsigned TX29                   :1;
        unsigned TX40                   :1;
        unsigned TX41                   :1;
        unsigned TX42                   :1;
        unsigned TX43                   :1;
        unsigned TX44                   :1;
        unsigned TX45                   :1;
    };
} AAD2TX1bits_t;
