MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile AADCON1bits_t AADCON1bits __at(0x712);
// bitfield macros
#define _AADCON1_ADPREF_POSN                                0x0
#define _AADCON1_ADPREF_POSITION                            0x0
#define _AADCON1_ADPREF_SIZE                                0x2
#define _AADCON1_ADPREF_LENGTH                              0x2
#define _AADCON1_ADPREF_MASK                                0x3
#define _AADCON1_GO_nDONE_ALL_POSN                          0x2
#define _AADCON1_GO_nDONE_ALL_POSITION                      0x2
#define _AADCON1_GO_nDONE_ALL_SIZE                          0x1
#define _AADCON1_GO_nDONE_ALL_LENGTH                        0x1
#define _AADCON1_GO_nDONE_ALL_MASK                          0x4
#define _AADCON1_ADNREF_POSN                                0x3
#define _AADCON1_ADNREF_POSITION                            0x3
#define _AADCON1_ADNREF_SIZE                                0x1
#define _AADCON1_ADNREF_LENGTH                              0x1
#define _AADCON1_ADNREF_MASK                                0x8
#define _AADCON1_ADCS_POSN                                  0x4
#define _AADCON1_ADCS_POSITION                              0x4
#define _AADCON1_ADCS_SIZE                                  0x3
#define _AADCON1_ADCS_LENGTH                                0x3
#define _AADCON1_ADCS_MASK                                  0x70
#define _AADCON1_ADFM_POSN                                  0x7
#define _AADCON1_ADFM_POSITION                              0x7
#define _AADCON1_ADFM_SIZE                                  0x1
#define _AADCON1_ADFM_LENGTH                                0x1
#define _AADCON1_ADFM_MASK                                  0x80
#define _AADCON1_ADPREF0_POSN                               0x0
#define _AADCON1_ADPREF0_POSITION                           0x0
#define _AADCON1_ADPREF0_SIZE                               0x1
#define _AADCON1_ADPREF0_LENGTH                             0x1
#define _AADCON1_ADPREF0_MASK                               0x1
#define _AADCON1_ADPREF1_POSN                               0x1
#define _AADCON1_ADPREF1_POSITION                           0x1
#define _AADCON1_ADPREF1_SIZE                               0x1
#define _AADCON1_ADPREF1_LENGTH                             0x1
#define _AADCON1_ADPREF1_MASK                               0x2
#define _AADCON1_GO_ALL_POSN                                0x2
#define _AADCON1_GO_ALL_POSITION                            0x2
#define _AADCON1_GO_ALL_SIZE                                0x1
#define _AADCON1_GO_ALL_LENGTH                              0x1
#define _AADCON1_GO_ALL_MASK                                0x4
#define _AADCON1_ADCS0_POSN                                 0x4
#define _AADCON1_ADCS0_POSITION                             0x4
#define _AADCON1_ADCS0_SIZE                                 0x1
#define _AADCON1_ADCS0_LENGTH                               0x1
#define _AADCON1_ADCS0_MASK                                 0x10
#define _AADCON1_ADCS1_POSN                                 0x5
#define _AADCON1_ADCS1_POSITION                             0x5
#define _AADCON1_ADCS1_SIZE                                 0x1
#define _AADCON1_ADCS1_LENGTH                               0x1
#define _AADCON1_ADCS1_MASK                                 0x20
#define _AADCON1_ADCS2_POSN                                 0x6
#define _AADCON1_ADCS2_POSITION                             0x6
#define _AADCON1_ADCS2_SIZE                                 0x1
#define _AADCON1_ADCS2_LENGTH                               0x1
#define _AADCON1_ADCS2_MASK                                 0x40

// Register: AD1CON2
#define AD1CON2 AD1CON2
extern volatile unsigned char           AD1CON2             __at(0x713);
#ifndef _LIB_BUILD
asm("AD1CON2 equ 0713h");
#endif
// aliases
extern volatile unsigned char           AADCON2             __at(0x713);
#ifndef _LIB_BUILD
asm("AADCON2 equ 0713h");
#endif
extern volatile unsigned char           AAD1CON2            __at(0x713);
#ifndef _LIB_BUILD
asm("AAD1CON2 equ 0713h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AD1CON2bits_t;
extern volatile AD1CON2bits_t AD1CON2bits __at(0x713);
// bitfield macros
#define _AD1CON2_TRIGSEL_POSN                               0x4
#define _AD1CON2_TRIGSEL_POSITION                           0x4
#define _AD1CON2_TRIGSEL_SIZE                               0x3
#define _AD1CON2_TRIGSEL_LENGTH                             0x3
#define _AD1CON2_TRIGSEL_MASK                               0x70
#define _AD1CON2_TRIGSEL0_POSN                              0x4
#define _AD1CON2_TRIGSEL0_POSITION                          0x4
#define _AD1CON2_TRIGSEL0_SIZE                              0x1
#define _AD1CON2_TRIGSEL0_LENGTH                            0x1
#define _AD1CON2_TRIGSEL0_MASK                              0x10
#define _AD1CON2_TRIGSEL1_POSN                              0x5
#define _AD1CON2_TRIGSEL1_POSITION                          0x5
#define _AD1CON2_TRIGSEL1_SIZE                              0x1
#define _AD1CON2_TRIGSEL1_LENGTH                            0x1
#define _AD1CON2_TRIGSEL1_MASK                              0x20
#define _AD1CON2_TRIGSEL2_POSN                              0x6
#define _AD1CON2_TRIGSEL2_POSITION                          0x6
#define _AD1CON2_TRIGSEL2_SIZE                              0x1
#define _AD1CON2_TRIGSEL2_LENGTH                            0x1
#define _AD1CON2_TRIGSEL2_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AADCON2bits_t;
extern volatile AADCON2bits_t AADCON2bits __at(0x713);
// bitfield macros
#define _AADCON2_TRIGSEL_POSN                               0x4
#define _AADCON2_TRIGSEL_POSITION                           0x4
#define _AADCON2_TRIGSEL_SIZE                               0x3
#define _AADCON2_TRIGSEL_LENGTH                             0x3
#define _AADCON2_TRIGSEL_MASK                               0x70
#define _AADCON2_TRIGSEL0_POSN                              0x4
#define _AADCON2_TRIGSEL0_POSITION                          0x4
#define _AADCON2_TRIGSEL0_SIZE                              0x1
#define _AADCON2_TRIGSEL0_LENGTH                            0x1
#define _AADCON2_TRIGSEL0_MASK                              0x10
#define _AADCON2_TRIGSEL1_POSN                              0x5
#define _AADCON2_TRIGSEL1_POSITION                          0x5
#define _AADCON2_TRIGSEL1_SIZE                              0x1
#define _AADCON2_TRIGSEL1_LENGTH                            0x1
#define _AADCON2_TRIGSEL1_MASK                              0x20
#define _AADCON2_TRIGSEL2_POSN                              0x6
#define _AADCON2_TRIGSEL2_POSITION                          0x6
#define _AADCON2_TRIGSEL2_SIZE                              0x1
#define _AADCON2_TRIGSEL2_LENGTH                            0x1
#define _AADCON2_TRIGSEL2_MASK                              0x40
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AAD1CON2bits_t;
extern volatile AAD1CON2bits_t AAD1CON2bits __at(0x713);
// bitfield macros
#define _AAD1CON2_TRIGSEL_POSN                              0x4
#define _AAD1CON2_TRIGSEL_POSITION                          0x4
#define _AAD1CON2_TRIGSEL_SIZE                              0x3
#define _AAD1CON2_TRIGSEL_LENGTH                            0x3
#define _AAD1CON2_TRIGSEL_MASK                              0x70
#define _AAD1CON2_TRIGSEL0_POSN                             0x4
#define _AAD1CON2_TRIGSEL0_POSITION                         0x4
#define _AAD1CON2_TRIGSEL0_SIZE                             0x1
#define _AAD1CON2_TRIGSEL0_LENGTH                           0x1
#define _AAD1CON2_TRIGSEL0_MASK                             0x10
#define _AAD1CON2_TRIGSEL1_POSN                             0x5
#define _AAD1CON2_TRIGSEL1_POSITION                         0x5
#define _AAD1CON2_TRIGSEL1_SIZE                             0x1
#define _AAD1CON2_TRIGSEL1_LENGTH                           0x1
#define _AAD1CON2_TRIGSEL1_MASK                             0x20
#define _AAD1CON2_TRIGSEL2_POSN                             0x6
#define _AAD1CON2_TRIGSEL2_POSITION                         0x6
#define _AAD1CON2_TRIGSEL2_SIZE                             0x1
#define _AAD1CON2_TRIGSEL2_LENGTH                           0x1
#define _AAD1CON2_TRIGSEL2_MASK                             0x40

