MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile ADSTATbits_t ADSTATbits __at(0x715);
// bitfield macros
#define _ADSTAT_AD1STG_POSN                                 0x0
#define _ADSTAT_AD1STG_POSITION                             0x0
#define _ADSTAT_AD1STG_SIZE                                 0x2
#define _ADSTAT_AD1STG_LENGTH                               0x2
#define _ADSTAT_AD1STG_MASK                                 0x3
#define _ADSTAT_AD1CONV_POSN                                0x2
#define _ADSTAT_AD1CONV_POSITION                            0x2
#define _ADSTAT_AD1CONV_SIZE                                0x1
#define _ADSTAT_AD1CONV_LENGTH                              0x1
#define _ADSTAT_AD1CONV_MASK                                0x4
#define _ADSTAT_AD2STG_POSN                                 0x4
#define _ADSTAT_AD2STG_POSITION                             0x4
#define _ADSTAT_AD2STG_SIZE                                 0x2
#define _ADSTAT_AD2STG_LENGTH                               0x2
#define _ADSTAT_AD2STG_MASK                                 0x30
#define _ADSTAT_AD2CONV_POSN                                0x6
#define _ADSTAT_AD2CONV_POSITION                            0x6
#define _ADSTAT_AD2CONV_SIZE                                0x1
#define _ADSTAT_AD2CONV_LENGTH                              0x1
#define _ADSTAT_AD2CONV_MASK                                0x40
#define _ADSTAT_ADSTG_POSN                                  0x0
#define _ADSTAT_ADSTG_POSITION                              0x0
#define _ADSTAT_ADSTG_SIZE                                  0x2
#define _ADSTAT_ADSTG_LENGTH                                0x2
#define _ADSTAT_ADSTG_MASK                                  0x3
#define _ADSTAT_ADCONV_POSN                                 0x2
#define _ADSTAT_ADCONV_POSITION                             0x2
#define _ADSTAT_ADCONV_SIZE                                 0x1
#define _ADSTAT_ADCONV_LENGTH                               0x1
#define _ADSTAT_ADCONV_MASK                                 0x4
#define _ADSTAT_AD1STG0_POSN                                0x0
#define _ADSTAT_AD1STG0_POSITION                            0x0
#define _ADSTAT_AD1STG0_SIZE                                0x1
#define _ADSTAT_AD1STG0_LENGTH                              0x1
#define _ADSTAT_AD1STG0_MASK                                0x1
#define _ADSTAT_AD1STG1_POSN                                0x1
#define _ADSTAT_AD1STG1_POSITION                            0x1
#define _ADSTAT_AD1STG1_SIZE                                0x1
#define _ADSTAT_AD1STG1_LENGTH                              0x1
#define _ADSTAT_AD1STG1_MASK                                0x2
#define _ADSTAT_AD2STG0_POSN                                0x4
#define _ADSTAT_AD2STG0_POSITION                            0x4
#define _ADSTAT_AD2STG0_SIZE                                0x1
#define _ADSTAT_AD2STG0_LENGTH                              0x1
#define _ADSTAT_AD2STG0_MASK                                0x10
#define _ADSTAT_AD2STG1_POSN                                0x5
#define _ADSTAT_AD2STG1_POSITION                            0x5
#define _ADSTAT_AD2STG1_SIZE                                0x1
#define _ADSTAT_AD2STG1_LENGTH                              0x1
#define _ADSTAT_AD2STG1_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned AD1STG                 :2;
        unsigned AD1CONV                :1;
        unsigned                        :1;
        unsigned AD2STG                 :2;
        unsigned AD2CONV                :1;
    };
    struct {
        unsigned ADSTG                  :2;
        unsigned ADCONV                 :1;
    };
    struct {
        unsigned AD1STG0                :1;
        unsigned AD1STG1                :1;
        unsigned                        :2;
        unsigned AD2STG0                :1;
        unsigned AD2STG1                :1;
    };
} AADSTATbits_t;
extern volatile AADSTATbits_t AADSTATbits __at(0x715);
// bitfield macros
#define _AADSTAT_AD1STG_POSN                                0x0
#define _AADSTAT_AD1STG_POSITION                            0x0
#define _AADSTAT_AD1STG_SIZE                                0x2
#define _AADSTAT_AD1STG_LENGTH                              0x2
#define _AADSTAT_AD1STG_MASK                                0x3
#define _AADSTAT_AD1CONV_POSN                               0x2
#define _AADSTAT_AD1CONV_POSITION                           0x2
#define _AADSTAT_AD1CONV_SIZE                               0x1
#define _AADSTAT_AD1CONV_LENGTH                             0x1
#define _AADSTAT_AD1CONV_MASK                               0x4
#define _AADSTAT_AD2STG_POSN                                0x4
#define _AADSTAT_AD2STG_POSITION                            0x4
#define _AADSTAT_AD2STG_SIZE                                0x2
#define _AADSTAT_AD2STG_LENGTH                              0x2
#define _AADSTAT_AD2STG_MASK                                0x30
#define _AADSTAT_AD2CONV_POSN                               0x6
#define _AADSTAT_AD2CONV_POSITION                           0x6
#define _AADSTAT_AD2CONV_SIZE                               0x1
#define _AADSTAT_AD2CONV_LENGTH                             0x1
#define _AADSTAT_AD2CONV_MASK                               0x40
#define _AADSTAT_ADSTG_POSN                                 0x0
#define _AADSTAT_ADSTG_POSITION                             0x0
#define _AADSTAT_ADSTG_SIZE                                 0x2
#define _AADSTAT_ADSTG_LENGTH                               0x2
#define _AADSTAT_ADSTG_MASK                                 0x3
#define _AADSTAT_ADCONV_POSN                                0x2
#define _AADSTAT_ADCONV_POSITION                            0x2
#define _AADSTAT_ADCONV_SIZE                                0x1
#define _AADSTAT_ADCONV_LENGTH                              0x1
#define _AADSTAT_ADCONV_MASK                                0x4
#define _AADSTAT_AD1STG0_POSN                               0x0
#define _AADSTAT_AD1STG0_POSITION                           0x0
#define _AADSTAT_AD1STG0_SIZE                               0x1
#define _AADSTAT_AD1STG0_LENGTH                             0x1
#define _AADSTAT_AD1STG0_MASK                               0x1
#define _AADSTAT_AD1STG1_POSN                               0x1
#define _AADSTAT_AD1STG1_POSITION                           0x1
#define _AADSTAT_AD1STG1_SIZE                               0x1
#define _AADSTAT_AD1STG1_LENGTH                             0x1
#define _AADSTAT_AD1STG1_MASK                               0x2
#define _AADSTAT_AD2STG0_POSN                               0x4
#define _AADSTAT_AD2STG0_POSITION                           0x4
#define _AADSTAT_AD2STG0_SIZE                               0x1
#define _AADSTAT_AD2STG0_LENGTH                             0x1
#define _AADSTAT_AD2STG0_MASK                               0x10
#define _AADSTAT_AD2STG1_POSN                               0x5
#define _AADSTAT_AD2STG1_POSITION                           0x5
#define _AADSTAT_AD2STG1_SIZE                               0x1
#define _AADSTAT_AD2STG1_LENGTH                             0x1
#define _AADSTAT_AD2STG1_MASK                               0x20

// Register: AD1PRECON
#define AD1PRECON AD1PRECON
extern volatile unsigned char           AD1PRECON           __at(0x716);
#ifndef _LIB_BUILD
asm("AD1PRECON equ 0716h");
#endif
// aliases
extern volatile unsigned char           AADPRE              __at(0x716);
#ifndef _LIB_BUILD
asm("AADPRE equ 0716h");
#endif
extern volatile unsigned char           AD1PRE              __at(0x716);
#ifndef _LIB_BUILD
asm("AD1PRE equ 0716h");
#endif
extern volatile unsigned char           AAD1PRE             __at(0x716);
#ifndef _LIB_BUILD
asm("AAD1PRE equ 0716h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AD1PRECONbits_t;
extern volatile AD1PRECONbits_t AD1PRECONbits __at(0x716);
// bitfield macros
#define _AD1PRECON_ADPRE_POSN                               0x0
#define _AD1PRECON_ADPRE_POSITION                           0x0
#define _AD1PRECON_ADPRE_SIZE                               0x7
#define _AD1PRECON_ADPRE_LENGTH                             0x7
#define _AD1PRECON_ADPRE_MASK                               0x7F
#define _AD1PRECON_ADPRE0_POSN                              0x0
#define _AD1PRECON_ADPRE0_POSITION                          0x0
#define _AD1PRECON_ADPRE0_SIZE                              0x1
#define _AD1PRECON_ADPRE0_LENGTH                            0x1
#define _AD1PRECON_ADPRE0_MASK                              0x1
#define _AD1PRECON_ADPRE1_POSN                              0x1
#define _AD1PRECON_ADPRE1_POSITION                          0x1
#define _AD1PRECON_ADPRE1_SIZE                              0x1
#define _AD1PRECON_ADPRE1_LENGTH                            0x1
#define _AD1PRECON_ADPRE1_MASK                              0x2
#define _AD1PRECON_ADPRE2_POSN                              0x2
#define _AD1PRECON_ADPRE2_POSITION                          0x2
#define _AD1PRECON_ADPRE2_SIZE                              0x1
#define _AD1PRECON_ADPRE2_LENGTH                            0x1
#define _AD1PRECON_ADPRE2_MASK                              0x4
#define _AD1PRECON_ADPRE3_POSN                              0x3
#define _AD1PRECON_ADPRE3_POSITION                          0x3
#define _AD1PRECON_ADPRE3_SIZE                              0x1
#define _AD1PRECON_ADPRE3_LENGTH                            0x1
#define _AD1PRECON_ADPRE3_MASK                              0x8
#define _AD1PRECON_ADPRE4_POSN                              0x4
#define _AD1PRECON_ADPRE4_POSITION                          0x4
#define _AD1PRECON_ADPRE4_SIZE                              0x1
#define _AD1PRECON_ADPRE4_LENGTH                            0x1
#define _AD1PRECON_ADPRE4_MASK                              0x10
#define _AD1PRECON_ADPRE5_POSN                              0x5
#define _AD1PRECON_ADPRE5_POSITION                          0x5
#define _AD1PRECON_ADPRE5_SIZE                              0x1
#define _AD1PRECON_ADPRE5_LENGTH                            0x1
#define _AD1PRECON_ADPRE5_MASK                              0x20
#define _AD1PRECON_ADPRE6_POSN                              0x6
#define _AD1PRECON_ADPRE6_POSITION                          0x6
#define _AD1PRECON_ADPRE6_SIZE                              0x1
#define _AD1PRECON_ADPRE6_LENGTH                            0x1
#define _AD1PRECON_ADPRE6_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AADPREbits_t;
extern volatile AADPREbits_t AADPREbits __at(0x716);
// bitfield macros
#define _AADPRE_ADPRE_POSN                                  0x0
#define _AADPRE_ADPRE_POSITION                              0x0
#define _AADPRE_ADPRE_SIZE                                  0x7
#define _AADPRE_ADPRE_LENGTH                                0x7
#define _AADPRE_ADPRE_MASK                                  0x7F
#define _AADPRE_ADPRE0_POSN                                 0x0
#define _AADPRE_ADPRE0_POSITION                             0x0
#define _AADPRE_ADPRE0_SIZE                                 0x1
#define _AADPRE_ADPRE0_LENGTH                               0x1
#define _AADPRE_ADPRE0_MASK                                 0x1
#define _AADPRE_ADPRE1_POSN                                 0x1
#define _AADPRE_ADPRE1_POSITION                             0x1
#define _AADPRE_ADPRE1_SIZE                                 0x1
#define _AADPRE_ADPRE1_LENGTH                               0x1
#define _AADPRE_ADPRE1_MASK                                 0x2
#define _AADPRE_ADPRE2_POSN                                 0x2
#define _AADPRE_ADPRE2_POSITION                             0x2
#define _AADPRE_ADPRE2_SIZE                                 0x1
#define _AADPRE_ADPRE2_LENGTH                               0x1
#define _AADPRE_ADPRE2_MASK                                 0x4
#define _AADPRE_ADPRE3_POSN                                 0x3
#define _AADPRE_ADPRE3_POSITION                             0x3
#define _AADPRE_ADPRE3_SIZE                                 0x1
#define _AADPRE_ADPRE3_LENGTH                               0x1
#define _AADPRE_ADPRE3_MASK                                 0x8
#define _AADPRE_ADPRE4_POSN                                 0x4
#define _AADPRE_ADPRE4_POSITION                             0x4
#define _AADPRE_ADPRE4_SIZE                                 0x1
#define _AADPRE_ADPRE4_LENGTH                               0x1
#define _AADPRE_ADPRE4_MASK                                 0x10
#define _AADPRE_ADPRE5_POSN                                 0x5
#define _AADPRE_ADPRE5_POSITION                             0x5
#define _AADPRE_ADPRE5_SIZE                                 0x1
#define _AADPRE_ADPRE5_LENGTH                               0x1
#define _AADPRE_ADPRE5_MASK                                 0x20
#define _AADPRE_ADPRE6_POSN                                 0x6
#define _AADPRE_ADPRE6_POSITION                             0x6
#define _AADPRE_ADPRE6_SIZE                                 0x1
#define _AADPRE_ADPRE6_LENGTH                               0x1
#define _AADPRE_ADPRE6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AD1PREbits_t;
extern volatile AD1PREbits_t AD1PREbits __at(0x716);
// bitfield macros
#define _AD1PRE_ADPRE_POSN                                  0x0
#define _AD1PRE_ADPRE_POSITION                              0x0
#define _AD1PRE_ADPRE_SIZE                                  0x7
#define _AD1PRE_ADPRE_LENGTH                                0x7
#define _AD1PRE_ADPRE_MASK                                  0x7F
#define _AD1PRE_ADPRE0_POSN                                 0x0
#define _AD1PRE_ADPRE0_POSITION                             0x0
#define _AD1PRE_ADPRE0_SIZE                                 0x1
#define _AD1PRE_ADPRE0_LENGTH                               0x1
#define _AD1PRE_ADPRE0_MASK                                 0x1
#define _AD1PRE_ADPRE1_POSN                                 0x1
#define _AD1PRE_ADPRE1_POSITION                             0x1
#define _AD1PRE_ADPRE1_SIZE                                 0x1
#define _AD1PRE_ADPRE1_LENGTH                               0x1
#define _AD1PRE_ADPRE1_MASK                                 0x2
#define _AD1PRE_ADPRE2_POSN                                 0x2
#define _AD1PRE_ADPRE2_POSITION                             0x2
#define _AD1PRE_ADPRE2_SIZE                                 0x1
#define _AD1PRE_ADPRE2_LENGTH                               0x1
#define _AD1PRE_ADPRE2_MASK                                 0x4
#define _AD1PRE_ADPRE3_POSN                                 0x3
#define _AD1PRE_ADPRE3_POSITION                             0x3
#define _AD1PRE_ADPRE3_SIZE                                 0x1
#define _AD1PRE_ADPRE3_LENGTH                               0x1
#define _AD1PRE_ADPRE3_MASK                                 0x8
#define _AD1PRE_ADPRE4_POSN                                 0x4
#define _AD1PRE_ADPRE4_POSITION                             0x4
#define _AD1PRE_ADPRE4_SIZE                                 0x1
#define _AD1PRE_ADPRE4_LENGTH                               0x1
#define _AD1PRE_ADPRE4_MASK                                 0x10
#define _AD1PRE_ADPRE5_POSN                                 0x5
#define _AD1PRE_ADPRE5_POSITION                             0x5
#define _AD1PRE_ADPRE5_SIZE                                 0x1
#define _AD1PRE_ADPRE5_LENGTH                               0x1
#define _AD1PRE_ADPRE5_MASK                                 0x20
#define _AD1PRE_ADPRE6_POSN                                 0x6
#define _AD1PRE_ADPRE6_POSITION                             0x6
#define _AD1PRE_ADPRE6_SIZE                                 0x1
#define _AD1PRE_ADPRE6_LENGTH                               0x1
#define _AD1PRE_ADPRE6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADPRE                  :7;
    };
    struct {
        unsigned ADPRE0                 :1;
        unsigned ADPRE1                 :1;
        unsigned ADPRE2                 :1;
        unsigned ADPRE3                 :1;
        unsigned ADPRE4                 :1;
        unsigned ADPRE5                 :1;
        unsigned ADPRE6                 :1;
    };
} AAD1PREbits_t;
extern volatile AAD1PREbits_t AAD1PREbits __at(0x716);
// bitfield macros
#define _AAD1PRE_ADPRE_POSN                                 0x0
#define _AAD1PRE_ADPRE_POSITION                             0x0
#define _AAD1PRE_ADPRE_SIZE                                 0x7
#define _AAD1PRE_ADPRE_LENGTH                               0x7
#define _AAD1PRE_ADPRE_MASK                                 0x7F
#define _AAD1PRE_ADPRE0_POSN                                0x0
#define _AAD1PRE_ADPRE0_POSITION                            0x0
#define _AAD1PRE_ADPRE0_SIZE                                0x1
#define _AAD1PRE_ADPRE0_LENGTH                              0x1
#define _AAD1PRE_ADPRE0_MASK                                0x1
#define _AAD1PRE_ADPRE1_POSN                                0x1
#define _AAD1PRE_ADPRE1_POSITION                            0x1
#define _AAD1PRE_ADPRE1_SIZE                                0x1
#define _AAD1PRE_ADPRE1_LENGTH                              0x1
#define _AAD1PRE_ADPRE1_MASK                                0x2
#define _AAD1PRE_ADPRE2_POSN                                0x2
#define _AAD1PRE_ADPRE2_POSITION                            0x2
#define _AAD1PRE_ADPRE2_SIZE                                0x1
#define _AAD1PRE_ADPRE2_LENGTH                              0x1
#define _AAD1PRE_ADPRE2_MASK                                0x4
#define _AAD1PRE_ADPRE3_POSN                                0x3
#define _AAD1PRE_ADPRE3_POSITION                            0x3
#define _AAD1PRE_ADPRE3_SIZE                                0x1
#define _AAD1PRE_ADPRE3_LENGTH                              0x1
#define _AAD1PRE_ADPRE3_MASK                                0x8
#define _AAD1PRE_ADPRE4_POSN                                0x4
#define _AAD1PRE_ADPRE4_POSITION                            0x4
#define _AAD1PRE_ADPRE4_SIZE                                0x1
#define _AAD1PRE_ADPRE4_LENGTH                              0x1
#define _AAD1PRE_ADPRE4_MASK                                0x10
#define _AAD1PRE_ADPRE5_POSN                                0x5
#define _AAD1PRE_ADPRE5_POSITION                            0x5
#define _AAD1PRE_ADPRE5_SIZE                                0x1
#define _AAD1PRE_ADPRE5_LENGTH                              0x1
#define _AAD1PRE_ADPRE5_MASK                                0x20
#define _AAD1PRE_ADPRE6_POSN                                0x6
#define _AAD1PRE_ADPRE6_POSITION                            0x6
#define _AAD1PRE_ADPRE6_SIZE                                0x1
#define _AAD1PRE_ADPRE6_LENGTH                              0x1
#define _AAD1PRE_ADPRE6_MASK                                0x40

// Register: AD1ACQCON
#define AD1ACQCON AD1ACQCON
extern volatile unsigned char           AD1ACQCON           __at(0x717);
#ifndef _LIB_BUILD
asm("AD1ACQCON equ 0717h");
#endif
// aliases
extern volatile unsigned char           AADACQ              __at(0x717);
#ifndef _LIB_BUILD
asm("AADACQ equ 0717h");
#endif
extern volatile unsigned char           AD1ACQ              __at(0x717);
#ifndef _LIB_BUILD
asm("AD1ACQ equ 0717h");
#endif
extern volatile unsigned char           AAD1ACQ             __at(0x717);
#ifndef _LIB_BUILD
asm("AAD1ACQ equ 0717h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AD1ACQCONbits_t;
