MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile AD1ACQCONbits_t AD1ACQCONbits __at(0x717);
// bitfield macros
#define _AD1ACQCON_ADACQ_POSN                               0x0
#define _AD1ACQCON_ADACQ_POSITION                           0x0
#define _AD1ACQCON_ADACQ_SIZE                               0x7
#define _AD1ACQCON_ADACQ_LENGTH                             0x7
#define _AD1ACQCON_ADACQ_MASK                               0x7F
#define _AD1ACQCON_ADACQ0_POSN                              0x0
#define _AD1ACQCON_ADACQ0_POSITION                          0x0
#define _AD1ACQCON_ADACQ0_SIZE                              0x1
#define _AD1ACQCON_ADACQ0_LENGTH                            0x1
#define _AD1ACQCON_ADACQ0_MASK                              0x1
#define _AD1ACQCON_ADACQ1_POSN                              0x1
#define _AD1ACQCON_ADACQ1_POSITION                          0x1
#define _AD1ACQCON_ADACQ1_SIZE                              0x1
#define _AD1ACQCON_ADACQ1_LENGTH                            0x1
#define _AD1ACQCON_ADACQ1_MASK                              0x2
#define _AD1ACQCON_ADACQ2_POSN                              0x2
#define _AD1ACQCON_ADACQ2_POSITION                          0x2
#define _AD1ACQCON_ADACQ2_SIZE                              0x1
#define _AD1ACQCON_ADACQ2_LENGTH                            0x1
#define _AD1ACQCON_ADACQ2_MASK                              0x4
#define _AD1ACQCON_ADACQ3_POSN                              0x3
#define _AD1ACQCON_ADACQ3_POSITION                          0x3
#define _AD1ACQCON_ADACQ3_SIZE                              0x1
#define _AD1ACQCON_ADACQ3_LENGTH                            0x1
#define _AD1ACQCON_ADACQ3_MASK                              0x8
#define _AD1ACQCON_ADACQ4_POSN                              0x4
#define _AD1ACQCON_ADACQ4_POSITION                          0x4
#define _AD1ACQCON_ADACQ4_SIZE                              0x1
#define _AD1ACQCON_ADACQ4_LENGTH                            0x1
#define _AD1ACQCON_ADACQ4_MASK                              0x10
#define _AD1ACQCON_ADACQ5_POSN                              0x5
#define _AD1ACQCON_ADACQ5_POSITION                          0x5
#define _AD1ACQCON_ADACQ5_SIZE                              0x1
#define _AD1ACQCON_ADACQ5_LENGTH                            0x1
#define _AD1ACQCON_ADACQ5_MASK                              0x20
#define _AD1ACQCON_ADACQ6_POSN                              0x6
#define _AD1ACQCON_ADACQ6_POSITION                          0x6
#define _AD1ACQCON_ADACQ6_SIZE                              0x1
#define _AD1ACQCON_ADACQ6_LENGTH                            0x1
#define _AD1ACQCON_ADACQ6_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AADACQbits_t;
extern volatile AADACQbits_t AADACQbits __at(0x717);
// bitfield macros
#define _AADACQ_ADACQ_POSN                                  0x0
#define _AADACQ_ADACQ_POSITION                              0x0
#define _AADACQ_ADACQ_SIZE                                  0x7
#define _AADACQ_ADACQ_LENGTH                                0x7
#define _AADACQ_ADACQ_MASK                                  0x7F
#define _AADACQ_ADACQ0_POSN                                 0x0
#define _AADACQ_ADACQ0_POSITION                             0x0
#define _AADACQ_ADACQ0_SIZE                                 0x1
#define _AADACQ_ADACQ0_LENGTH                               0x1
#define _AADACQ_ADACQ0_MASK                                 0x1
#define _AADACQ_ADACQ1_POSN                                 0x1
#define _AADACQ_ADACQ1_POSITION                             0x1
#define _AADACQ_ADACQ1_SIZE                                 0x1
#define _AADACQ_ADACQ1_LENGTH                               0x1
#define _AADACQ_ADACQ1_MASK                                 0x2
#define _AADACQ_ADACQ2_POSN                                 0x2
#define _AADACQ_ADACQ2_POSITION                             0x2
#define _AADACQ_ADACQ2_SIZE                                 0x1
#define _AADACQ_ADACQ2_LENGTH                               0x1
#define _AADACQ_ADACQ2_MASK                                 0x4
#define _AADACQ_ADACQ3_POSN                                 0x3
#define _AADACQ_ADACQ3_POSITION                             0x3
#define _AADACQ_ADACQ3_SIZE                                 0x1
#define _AADACQ_ADACQ3_LENGTH                               0x1
#define _AADACQ_ADACQ3_MASK                                 0x8
#define _AADACQ_ADACQ4_POSN                                 0x4
#define _AADACQ_ADACQ4_POSITION                             0x4
#define _AADACQ_ADACQ4_SIZE                                 0x1
#define _AADACQ_ADACQ4_LENGTH                               0x1
#define _AADACQ_ADACQ4_MASK                                 0x10
#define _AADACQ_ADACQ5_POSN                                 0x5
#define _AADACQ_ADACQ5_POSITION                             0x5
#define _AADACQ_ADACQ5_SIZE                                 0x1
#define _AADACQ_ADACQ5_LENGTH                               0x1
#define _AADACQ_ADACQ5_MASK                                 0x20
#define _AADACQ_ADACQ6_POSN                                 0x6
#define _AADACQ_ADACQ6_POSITION                             0x6
#define _AADACQ_ADACQ6_SIZE                                 0x1
#define _AADACQ_ADACQ6_LENGTH                               0x1
#define _AADACQ_ADACQ6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AD1ACQbits_t;
extern volatile AD1ACQbits_t AD1ACQbits __at(0x717);
// bitfield macros
#define _AD1ACQ_ADACQ_POSN                                  0x0
#define _AD1ACQ_ADACQ_POSITION                              0x0
#define _AD1ACQ_ADACQ_SIZE                                  0x7
#define _AD1ACQ_ADACQ_LENGTH                                0x7
#define _AD1ACQ_ADACQ_MASK                                  0x7F
#define _AD1ACQ_ADACQ0_POSN                                 0x0
#define _AD1ACQ_ADACQ0_POSITION                             0x0
#define _AD1ACQ_ADACQ0_SIZE                                 0x1
#define _AD1ACQ_ADACQ0_LENGTH                               0x1
#define _AD1ACQ_ADACQ0_MASK                                 0x1
#define _AD1ACQ_ADACQ1_POSN                                 0x1
#define _AD1ACQ_ADACQ1_POSITION                             0x1
#define _AD1ACQ_ADACQ1_SIZE                                 0x1
#define _AD1ACQ_ADACQ1_LENGTH                               0x1
#define _AD1ACQ_ADACQ1_MASK                                 0x2
#define _AD1ACQ_ADACQ2_POSN                                 0x2
#define _AD1ACQ_ADACQ2_POSITION                             0x2
#define _AD1ACQ_ADACQ2_SIZE                                 0x1
#define _AD1ACQ_ADACQ2_LENGTH                               0x1
#define _AD1ACQ_ADACQ2_MASK                                 0x4
#define _AD1ACQ_ADACQ3_POSN                                 0x3
#define _AD1ACQ_ADACQ3_POSITION                             0x3
#define _AD1ACQ_ADACQ3_SIZE                                 0x1
#define _AD1ACQ_ADACQ3_LENGTH                               0x1
#define _AD1ACQ_ADACQ3_MASK                                 0x8
#define _AD1ACQ_ADACQ4_POSN                                 0x4
#define _AD1ACQ_ADACQ4_POSITION                             0x4
#define _AD1ACQ_ADACQ4_SIZE                                 0x1
#define _AD1ACQ_ADACQ4_LENGTH                               0x1
#define _AD1ACQ_ADACQ4_MASK                                 0x10
#define _AD1ACQ_ADACQ5_POSN                                 0x5
#define _AD1ACQ_ADACQ5_POSITION                             0x5
#define _AD1ACQ_ADACQ5_SIZE                                 0x1
#define _AD1ACQ_ADACQ5_LENGTH                               0x1
#define _AD1ACQ_ADACQ5_MASK                                 0x20
#define _AD1ACQ_ADACQ6_POSN                                 0x6
#define _AD1ACQ_ADACQ6_POSITION                             0x6
#define _AD1ACQ_ADACQ6_SIZE                                 0x1
#define _AD1ACQ_ADACQ6_LENGTH                               0x1
#define _AD1ACQ_ADACQ6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AAD1ACQbits_t;
extern volatile AAD1ACQbits_t AAD1ACQbits __at(0x717);
// bitfield macros
#define _AAD1ACQ_ADACQ_POSN                                 0x0
#define _AAD1ACQ_ADACQ_POSITION                             0x0
#define _AAD1ACQ_ADACQ_SIZE                                 0x7
#define _AAD1ACQ_ADACQ_LENGTH                               0x7
#define _AAD1ACQ_ADACQ_MASK                                 0x7F
#define _AAD1ACQ_ADACQ0_POSN                                0x0
#define _AAD1ACQ_ADACQ0_POSITION                            0x0
#define _AAD1ACQ_ADACQ0_SIZE                                0x1
#define _AAD1ACQ_ADACQ0_LENGTH                              0x1
#define _AAD1ACQ_ADACQ0_MASK                                0x1
#define _AAD1ACQ_ADACQ1_POSN                                0x1
#define _AAD1ACQ_ADACQ1_POSITION                            0x1
#define _AAD1ACQ_ADACQ1_SIZE                                0x1
#define _AAD1ACQ_ADACQ1_LENGTH                              0x1
#define _AAD1ACQ_ADACQ1_MASK                                0x2
#define _AAD1ACQ_ADACQ2_POSN                                0x2
#define _AAD1ACQ_ADACQ2_POSITION                            0x2
#define _AAD1ACQ_ADACQ2_SIZE                                0x1
#define _AAD1ACQ_ADACQ2_LENGTH                              0x1
#define _AAD1ACQ_ADACQ2_MASK                                0x4
#define _AAD1ACQ_ADACQ3_POSN                                0x3
#define _AAD1ACQ_ADACQ3_POSITION                            0x3
#define _AAD1ACQ_ADACQ3_SIZE                                0x1
#define _AAD1ACQ_ADACQ3_LENGTH                              0x1
#define _AAD1ACQ_ADACQ3_MASK                                0x8
#define _AAD1ACQ_ADACQ4_POSN                                0x4
#define _AAD1ACQ_ADACQ4_POSITION                            0x4
#define _AAD1ACQ_ADACQ4_SIZE                                0x1
#define _AAD1ACQ_ADACQ4_LENGTH                              0x1
#define _AAD1ACQ_ADACQ4_MASK                                0x10
#define _AAD1ACQ_ADACQ5_POSN                                0x5
#define _AAD1ACQ_ADACQ5_POSITION                            0x5
#define _AAD1ACQ_ADACQ5_SIZE                                0x1
#define _AAD1ACQ_ADACQ5_LENGTH                              0x1
#define _AAD1ACQ_ADACQ5_MASK                                0x20
#define _AAD1ACQ_ADACQ6_POSN                                0x6
#define _AAD1ACQ_ADACQ6_POSITION                            0x6
#define _AAD1ACQ_ADACQ6_SIZE                                0x1
#define _AAD1ACQ_ADACQ6_LENGTH                              0x1
#define _AAD1ACQ_ADACQ6_MASK                                0x40

// Register: AD1GRD
#define AD1GRD AD1GRD
extern volatile unsigned char           AD1GRD              __at(0x718);
#ifndef _LIB_BUILD
asm("AD1GRD equ 0718h");
#endif
// aliases
extern volatile unsigned char           AADGRD              __at(0x718);
#ifndef _LIB_BUILD
asm("AADGRD equ 0718h");
#endif
extern volatile unsigned char           AAD1GRD             __at(0x718);
#ifndef _LIB_BUILD
asm("AAD1GRD equ 0718h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX1POL                 :1;
        unsigned                        :4;
        unsigned GRD1POL                :1;
        unsigned GRD1AOE                :1;
        unsigned GRD1BOE                :1;
    };
    struct {
        unsigned TXPOL                  :1;
        unsigned                        :4;
        unsigned GRDPOL                 :1;
        unsigned GRDAOE                 :1;
        unsigned GRDBOE                 :1;
    };
} AD1GRDbits_t;
