MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile AAD2CH0bits_t AAD2CH0bits __at(0x79E);
// bitfield macros
#define _AAD2CH0_CH20_POSN                                  0x0
#define _AAD2CH0_CH20_POSITION                              0x0
#define _AAD2CH0_CH20_SIZE                                  0x1
#define _AAD2CH0_CH20_LENGTH                                0x1
#define _AAD2CH0_CH20_MASK                                  0x1
#define _AAD2CH0_CH21_POSN                                  0x1
#define _AAD2CH0_CH21_POSITION                              0x1
#define _AAD2CH0_CH21_SIZE                                  0x1
#define _AAD2CH0_CH21_LENGTH                                0x1
#define _AAD2CH0_CH21_MASK                                  0x2
#define _AAD2CH0_CH22_POSN                                  0x2
#define _AAD2CH0_CH22_POSITION                              0x2
#define _AAD2CH0_CH22_SIZE                                  0x1
#define _AAD2CH0_CH22_LENGTH                                0x1
#define _AAD2CH0_CH22_MASK                                  0x4
#define _AAD2CH0_CH23_POSN                                  0x3
#define _AAD2CH0_CH23_POSITION                              0x3
#define _AAD2CH0_CH23_SIZE                                  0x1
#define _AAD2CH0_CH23_LENGTH                                0x1
#define _AAD2CH0_CH23_MASK                                  0x8
#define _AAD2CH0_CH24_POSN                                  0x4
#define _AAD2CH0_CH24_POSITION                              0x4
#define _AAD2CH0_CH24_SIZE                                  0x1
#define _AAD2CH0_CH24_LENGTH                                0x1
#define _AAD2CH0_CH24_MASK                                  0x10
#define _AAD2CH0_CH25_POSN                                  0x5
#define _AAD2CH0_CH25_POSITION                              0x5
#define _AAD2CH0_CH25_SIZE                                  0x1
#define _AAD2CH0_CH25_LENGTH                                0x1
#define _AAD2CH0_CH25_MASK                                  0x20
#define _AAD2CH0_CH26_POSN                                  0x6
#define _AAD2CH0_CH26_POSITION                              0x6
#define _AAD2CH0_CH26_SIZE                                  0x1
#define _AAD2CH0_CH26_LENGTH                                0x1
#define _AAD2CH0_CH26_MASK                                  0x40
#define _AAD2CH0_CH27_POSN                                  0x7
#define _AAD2CH0_CH27_POSITION                              0x7
#define _AAD2CH0_CH27_SIZE                                  0x1
#define _AAD2CH0_CH27_LENGTH                                0x1
#define _AAD2CH0_CH27_MASK                                  0x80

// Register: AD2CH1
#define AD2CH1 AD2CH1
extern volatile unsigned char           AD2CH1              __at(0x79F);
#ifndef _LIB_BUILD
asm("AD2CH1 equ 079Fh");
#endif
// aliases
extern volatile unsigned char           AAD2CH1             __at(0x79F);
#ifndef _LIB_BUILD
asm("AAD2CH1 equ 079Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH28                   :1;
        unsigned CH29                   :1;
        unsigned CH40                   :1;
        unsigned CH41                   :1;
        unsigned CH42                   :1;
        unsigned CH43                   :1;
        unsigned CH44                   :1;
        unsigned CH45                   :1;
    };
} AD2CH1bits_t;
extern volatile AD2CH1bits_t AD2CH1bits __at(0x79F);
// bitfield macros
#define _AD2CH1_CH28_POSN                                   0x0
#define _AD2CH1_CH28_POSITION                               0x0
#define _AD2CH1_CH28_SIZE                                   0x1
#define _AD2CH1_CH28_LENGTH                                 0x1
#define _AD2CH1_CH28_MASK                                   0x1
#define _AD2CH1_CH29_POSN                                   0x1
#define _AD2CH1_CH29_POSITION                               0x1
#define _AD2CH1_CH29_SIZE                                   0x1
#define _AD2CH1_CH29_LENGTH                                 0x1
#define _AD2CH1_CH29_MASK                                   0x2
#define _AD2CH1_CH40_POSN                                   0x2
#define _AD2CH1_CH40_POSITION                               0x2
#define _AD2CH1_CH40_SIZE                                   0x1
#define _AD2CH1_CH40_LENGTH                                 0x1
#define _AD2CH1_CH40_MASK                                   0x4
#define _AD2CH1_CH41_POSN                                   0x3
#define _AD2CH1_CH41_POSITION                               0x3
#define _AD2CH1_CH41_SIZE                                   0x1
#define _AD2CH1_CH41_LENGTH                                 0x1
#define _AD2CH1_CH41_MASK                                   0x8
#define _AD2CH1_CH42_POSN                                   0x4
#define _AD2CH1_CH42_POSITION                               0x4
#define _AD2CH1_CH42_SIZE                                   0x1
#define _AD2CH1_CH42_LENGTH                                 0x1
#define _AD2CH1_CH42_MASK                                   0x10
#define _AD2CH1_CH43_POSN                                   0x5
#define _AD2CH1_CH43_POSITION                               0x5
#define _AD2CH1_CH43_SIZE                                   0x1
#define _AD2CH1_CH43_LENGTH                                 0x1
#define _AD2CH1_CH43_MASK                                   0x20
#define _AD2CH1_CH44_POSN                                   0x6
#define _AD2CH1_CH44_POSITION                               0x6
#define _AD2CH1_CH44_SIZE                                   0x1
#define _AD2CH1_CH44_LENGTH                                 0x1
#define _AD2CH1_CH44_MASK                                   0x40
#define _AD2CH1_CH45_POSN                                   0x7
#define _AD2CH1_CH45_POSITION                               0x7
#define _AD2CH1_CH45_SIZE                                   0x1
#define _AD2CH1_CH45_LENGTH                                 0x1
#define _AD2CH1_CH45_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH28                   :1;
        unsigned CH29                   :1;
        unsigned CH40                   :1;
        unsigned CH41                   :1;
        unsigned CH42                   :1;
        unsigned CH43                   :1;
        unsigned CH44                   :1;
        unsigned CH45                   :1;
    };
} AAD2CH1bits_t;
extern volatile AAD2CH1bits_t AAD2CH1bits __at(0x79F);
// bitfield macros
#define _AAD2CH1_CH28_POSN                                  0x0
#define _AAD2CH1_CH28_POSITION                              0x0
#define _AAD2CH1_CH28_SIZE                                  0x1
#define _AAD2CH1_CH28_LENGTH                                0x1
#define _AAD2CH1_CH28_MASK                                  0x1
#define _AAD2CH1_CH29_POSN                                  0x1
#define _AAD2CH1_CH29_POSITION                              0x1
#define _AAD2CH1_CH29_SIZE                                  0x1
#define _AAD2CH1_CH29_LENGTH                                0x1
#define _AAD2CH1_CH29_MASK                                  0x2
#define _AAD2CH1_CH40_POSN                                  0x2
#define _AAD2CH1_CH40_POSITION                              0x2
#define _AAD2CH1_CH40_SIZE                                  0x1
#define _AAD2CH1_CH40_LENGTH                                0x1
#define _AAD2CH1_CH40_MASK                                  0x4
#define _AAD2CH1_CH41_POSN                                  0x3
#define _AAD2CH1_CH41_POSITION                              0x3
#define _AAD2CH1_CH41_SIZE                                  0x1
#define _AAD2CH1_CH41_LENGTH                                0x1
#define _AAD2CH1_CH41_MASK                                  0x8
#define _AAD2CH1_CH42_POSN                                  0x4
#define _AAD2CH1_CH42_POSITION                              0x4
#define _AAD2CH1_CH42_SIZE                                  0x1
#define _AAD2CH1_CH42_LENGTH                                0x1
#define _AAD2CH1_CH42_MASK                                  0x10
#define _AAD2CH1_CH43_POSN                                  0x5
#define _AAD2CH1_CH43_POSITION                              0x5
#define _AAD2CH1_CH43_SIZE                                  0x1
#define _AAD2CH1_CH43_LENGTH                                0x1
#define _AAD2CH1_CH43_MASK                                  0x20
#define _AAD2CH1_CH44_POSN                                  0x6
#define _AAD2CH1_CH44_POSITION                              0x6
#define _AAD2CH1_CH44_SIZE                                  0x1
#define _AAD2CH1_CH44_LENGTH                                0x1
#define _AAD2CH1_CH44_MASK                                  0x40
#define _AAD2CH1_CH45_POSN                                  0x7
#define _AAD2CH1_CH45_POSITION                              0x7
#define _AAD2CH1_CH45_SIZE                                  0x1
#define _AAD2CH1_CH45_LENGTH                                0x1
#define _AAD2CH1_CH45_MASK                                  0x80

// Register: ICDIO
#define ICDIO ICDIO
extern volatile unsigned char           ICDIO               __at(0xF8C);
#ifndef _LIB_BUILD
asm("ICDIO equ 0F8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned TRIS_ICDCLK            :1;
        unsigned TRIS_ICDDAT            :1;
        unsigned LAT_ICDCLK             :1;
        unsigned LAT_ICDDAT             :1;
        unsigned PORT_ICDCLK            :1;
        unsigned PORT_ICDDAT            :1;
    };
} ICDIObits_t;
