MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
#define                                 CH28_bit            _BIT_ACCESS(AD2CH1,0)
// AD2CH1<CH29>
extern volatile __bit                   CH29                __at(0x3CF9);	// @ (0x79F * 8 + 1)
#define                                 CH29_bit            _BIT_ACCESS(AD2CH1,1)
// AD1CH1<CH30>
extern volatile __bit                   CH30                __at(0x38FA);	// @ (0x71F * 8 + 2)
#define                                 CH30_bit            _BIT_ACCESS(AD1CH1,2)
// AD1CH1<CH31>
extern volatile __bit                   CH31                __at(0x38FB);	// @ (0x71F * 8 + 3)
#define                                 CH31_bit            _BIT_ACCESS(AD1CH1,3)
// AD1CH1<CH32>
extern volatile __bit                   CH32                __at(0x38FC);	// @ (0x71F * 8 + 4)
#define                                 CH32_bit            _BIT_ACCESS(AD1CH1,4)
// AD1CH1<CH33>
extern volatile __bit                   CH33                __at(0x38FD);	// @ (0x71F * 8 + 5)
#define                                 CH33_bit            _BIT_ACCESS(AD1CH1,5)
// AD1CH1<CH34>
extern volatile __bit                   CH34                __at(0x38FE);	// @ (0x71F * 8 + 6)
#define                                 CH34_bit            _BIT_ACCESS(AD1CH1,6)
// AD1CH1<CH35>
extern volatile __bit                   CH35                __at(0x38FF);	// @ (0x71F * 8 + 7)
#define                                 CH35_bit            _BIT_ACCESS(AD1CH1,7)
// AD2CH1<CH40>
extern volatile __bit                   CH40                __at(0x3CFA);	// @ (0x79F * 8 + 2)
#define                                 CH40_bit            _BIT_ACCESS(AD2CH1,2)
// AD2CH1<CH41>
extern volatile __bit                   CH41                __at(0x3CFB);	// @ (0x79F * 8 + 3)
#define                                 CH41_bit            _BIT_ACCESS(AD2CH1,3)
// AD2CH1<CH42>
extern volatile __bit                   CH42                __at(0x3CFC);	// @ (0x79F * 8 + 4)
#define                                 CH42_bit            _BIT_ACCESS(AD2CH1,4)
// AD2CH1<CH43>
extern volatile __bit                   CH43                __at(0x3CFD);	// @ (0x79F * 8 + 5)
#define                                 CH43_bit            _BIT_ACCESS(AD2CH1,5)
// AD2CH1<CH44>
extern volatile __bit                   CH44                __at(0x3CFE);	// @ (0x79F * 8 + 6)
#define                                 CH44_bit            _BIT_ACCESS(AD2CH1,6)
// AD2CH1<CH45>
extern volatile __bit                   CH45                __at(0x3CFF);	// @ (0x79F * 8 + 7)
#define                                 CH45_bit            _BIT_ACCESS(AD2CH1,7)
// AD1CH0<CHS17>
extern volatile __bit                   CHS17               __at(0x38F7);	// @ (0x71E * 8 + 7)
#define                                 CHS17_bit           _BIT_ACCESS(AD1CH0,7)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0xCEC);	// @ (0x19D * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0xCF7);	// @ (0x19E * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// ICDINSTL<DBGIN0>
extern volatile __bit                   DBGIN0              __at(0x7CB0);	// @ (0xF96 * 8 + 0)
#define                                 DBGIN0_bit          _BIT_ACCESS(ICDINSTL,0)
// ICDINSTL<DBGIN1>
extern volatile __bit                   DBGIN1              __at(0x7CB1);	// @ (0xF96 * 8 + 1)
#define                                 DBGIN1_bit          _BIT_ACCESS(ICDINSTL,1)
// ICDINSTH<DBGIN10>
extern volatile __bit                   DBGIN10             __at(0x7CBA);	// @ (0xF97 * 8 + 2)
#define                                 DBGIN10_bit         _BIT_ACCESS(ICDINSTH,2)
// ICDINSTH<DBGIN11>
extern volatile __bit                   DBGIN11             __at(0x7CBB);	// @ (0xF97 * 8 + 3)
#define                                 DBGIN11_bit         _BIT_ACCESS(ICDINSTH,3)
// ICDINSTH<DBGIN12>
extern volatile __bit                   DBGIN12             __at(0x7CBC);	// @ (0xF97 * 8 + 4)
#define                                 DBGIN12_bit         _BIT_ACCESS(ICDINSTH,4)
// ICDINSTH<DBGIN13>
extern volatile __bit                   DBGIN13             __at(0x7CBD);	// @ (0xF97 * 8 + 5)
#define                                 DBGIN13_bit         _BIT_ACCESS(ICDINSTH,5)
// ICDINSTL<DBGIN2>
extern volatile __bit                   DBGIN2              __at(0x7CB2);	// @ (0xF96 * 8 + 2)
#define                                 DBGIN2_bit          _BIT_ACCESS(ICDINSTL,2)
// ICDINSTL<DBGIN3>
extern volatile __bit                   DBGIN3              __at(0x7CB3);	// @ (0xF96 * 8 + 3)
#define                                 DBGIN3_bit          _BIT_ACCESS(ICDINSTL,3)
// ICDINSTL<DBGIN4>
extern volatile __bit                   DBGIN4              __at(0x7CB4);	// @ (0xF96 * 8 + 4)
#define                                 DBGIN4_bit          _BIT_ACCESS(ICDINSTL,4)
// ICDINSTL<DBGIN5>
extern volatile __bit                   DBGIN5              __at(0x7CB5);	// @ (0xF96 * 8 + 5)
#define                                 DBGIN5_bit          _BIT_ACCESS(ICDINSTL,5)
// ICDINSTL<DBGIN6>
extern volatile __bit                   DBGIN6              __at(0x7CB6);	// @ (0xF96 * 8 + 6)
#define                                 DBGIN6_bit          _BIT_ACCESS(ICDINSTL,6)
// ICDINSTL<DBGIN7>
extern volatile __bit                   DBGIN7              __at(0x7CB7);	// @ (0xF96 * 8 + 7)
#define                                 DBGIN7_bit          _BIT_ACCESS(ICDINSTL,7)
// ICDINSTH<DBGIN8>
extern volatile __bit                   DBGIN8              __at(0x7CB8);	// @ (0xF97 * 8 + 0)
#define                                 DBGIN8_bit          _BIT_ACCESS(ICDINSTH,0)
// ICDINSTH<DBGIN9>
extern volatile __bit                   DBGIN9              __at(0x7CB9);	// @ (0xF97 * 8 + 1)
#define                                 DBGIN9_bit          _BIT_ACCESS(ICDINSTH,1)
// ICDCON0<DBGINEX>
extern volatile __bit                   DBGINEX             __at(0x7C6B);	// @ (0xF8D * 8 + 3)
#define                                 DBGINEX_bit         _BIT_ACCESS(ICDCON0,3)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// ICDCON0<FREEZ>
extern volatile __bit                   FREEZ               __at(0x7C6E);	// @ (0xF8D * 8 + 6)
#define                                 FREEZ_bit           _BIT_ACCESS(ICDCON0,6)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x8BF);	// @ (0x117 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x8BE);	// @ (0x117 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// AD1CON0<GO_nDONE1>
extern volatile __bit                   GO_nDONE1           __at(0x3889);	// @ (0x711 * 8 + 1)
#define                                 GO_nDONE1_bit       _BIT_ACCESS(AD1CON0,1)
// AD2CON0<GO_nDONE2>
extern volatile __bit                   GO_nDONE2           __at(0x3C89);	// @ (0x791 * 8 + 1)
#define                                 GO_nDONE2_bit       _BIT_ACCESS(AD2CON0,1)
// AD1GRD<GRD1AOE>
extern volatile __bit                   GRD1AOE             __at(0x38C6);	// @ (0x718 * 8 + 6)
#define                                 GRD1AOE_bit         _BIT_ACCESS(AD1GRD,6)
// AD1GRD<GRD1BOE>
extern volatile __bit                   GRD1BOE             __at(0x38C7);	// @ (0x718 * 8 + 7)
#define                                 GRD1BOE_bit         _BIT_ACCESS(AD1GRD,7)
// AD1GRD<GRD1POL>
extern volatile __bit                   GRD1POL             __at(0x38C5);	// @ (0x718 * 8 + 5)
#define                                 GRD1POL_bit         _BIT_ACCESS(AD1GRD,5)
// AD2GRD<GRD2AOE>
extern volatile __bit                   GRD2AOE             __at(0x3CC6);	// @ (0x798 * 8 + 6)
#define                                 GRD2AOE_bit         _BIT_ACCESS(AD2GRD,6)
// AD2GRD<GRD2BOE>
extern volatile __bit                   GRD2BOE             __at(0x3CC7);	// @ (0x798 * 8 + 7)
#define                                 GRD2BOE_bit         _BIT_ACCESS(AD2GRD,7)
// AD2GRD<GRD2POL>
extern volatile __bit                   GRD2POL             __at(0x3CC5);	// @ (0x798 * 8 + 5)
#define                                 GRD2POL_bit         _BIT_ACCESS(AD2GRD,5)
// APFCON<GRDASEL>
extern volatile __bit                   GRDASEL             __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 GRDASEL_bit         _BIT_ACCESS(APFCON,0)
// APFCON<GRDBSEL>
extern volatile __bit                   GRDBSEL             __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 GRDBSEL_bit         _BIT_ACCESS(APFCON,1)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// ICDCON0<INBUG>
extern volatile __bit                   INBUG               __at(0x7C6F);	// @ (0xF8D * 8 + 7)
#define                                 INBUG_bit           _BIT_ACCESS(ICDCON0,7)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0x1CB0);	// @ (0x396 * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0x1CB1);	// @ (0x396 * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0x1CB2);	// @ (0x396 * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0x1CB3);	// @ (0x396 * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0x1CB4);	// @ (0x396 * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0x1CB5);	// @ (0x396 * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0x1CB6);	// @ (0x396 * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0x1CB7);	// @ (0x396 * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0x1CA8);	// @ (0x395 * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0x1CA9);	// @ (0x395 * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0x1CAA);	// @ (0x395 * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0x1CAB);	// @ (0x395 * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0x1CAC);	// @ (0x395 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0x1CAD);	// @ (0x395 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0x1CAE);	// @ (0x395 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0x1CAF);	// @ (0x395 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0x1CA0);	// @ (0x394 * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0x1CA1);	// @ (0x394 * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0x1CA2);	// @ (0x394 * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0x1CA3);	// @ (0x394 * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0x1CA4);	// @ (0x394 * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0x1CA5);	// @ (0x394 * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0x1CA6);	// @ (0x394 * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0x1CA7);	// @ (0x394 * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x4CB);	// @ (0x99 * 8 + 3)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,3)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x4CC);	// @ (0x99 * 8 + 4)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x4CD);	// @ (0x99 * 8 + 5)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF3>
extern volatile __bit                   IRCF3               __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 IRCF3_bit           _BIT_ACCESS(OSCCON,6)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x860);	// @ (0x10C * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x861);	// @ (0x10C * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x862);	// @ (0x10C * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0x863);	// @ (0x10C * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0x864);	// @ (0x10C * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0x865);	// @ (0x10C * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0x866);	// @ (0x10C * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
extern volatile __bit                   LATA7               __at(0x867);	// @ (0x10C * 8 + 7)
#define                                 LATA7_bit           _BIT_ACCESS(LATA,7)
// LATB<LATB0>
extern volatile __bit                   LATB0               __at(0x868);	// @ (0x10D * 8 + 0)
#define                                 LATB0_bit           _BIT_ACCESS(LATB,0)
// LATB<LATB1>
extern volatile __bit                   LATB1               __at(0x869);	// @ (0x10D * 8 + 1)
#define                                 LATB1_bit           _BIT_ACCESS(LATB,1)
// LATB<LATB2>
extern volatile __bit                   LATB2               __at(0x86A);	// @ (0x10D * 8 + 2)
#define                                 LATB2_bit           _BIT_ACCESS(LATB,2)
// LATB<LATB3>
extern volatile __bit                   LATB3               __at(0x86B);	// @ (0x10D * 8 + 3)
#define                                 LATB3_bit           _BIT_ACCESS(LATB,3)
// LATB<LATB4>
extern volatile __bit                   LATB4               __at(0x86C);	// @ (0x10D * 8 + 4)
#define                                 LATB4_bit           _BIT_ACCESS(LATB,4)
// LATB<LATB5>
extern volatile __bit                   LATB5               __at(0x86D);	// @ (0x10D * 8 + 5)
#define                                 LATB5_bit           _BIT_ACCESS(LATB,5)
// LATB<LATB6>
extern volatile __bit                   LATB6               __at(0x86E);	// @ (0x10D * 8 + 6)
#define                                 LATB6_bit           _BIT_ACCESS(LATB,6)
// LATB<LATB7>
extern volatile __bit                   LATB7               __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 LATB7_bit           _BIT_ACCESS(LATB,7)
// LATC<LATC0>
extern volatile __bit                   LATC0               __at(0x870);	// @ (0x10E * 8 + 0)
#define                                 LATC0_bit           _BIT_ACCESS(LATC,0)
// LATC<LATC1>
extern volatile __bit                   LATC1               __at(0x871);	// @ (0x10E * 8 + 1)
#define                                 LATC1_bit           _BIT_ACCESS(LATC,1)
// LATC<LATC2>
extern volatile __bit                   LATC2               __at(0x872);	// @ (0x10E * 8 + 2)
#define                                 LATC2_bit           _BIT_ACCESS(LATC,2)
// LATC<LATC3>
extern volatile __bit                   LATC3               __at(0x873);	// @ (0x10E * 8 + 3)
#define                                 LATC3_bit           _BIT_ACCESS(LATC,3)
// LATC<LATC4>
extern volatile __bit                   LATC4               __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 LATC4_bit           _BIT_ACCESS(LATC,4)
// LATC<LATC5>
extern volatile __bit                   LATC5               __at(0x875);	// @ (0x10E * 8 + 5)
#define                                 LATC5_bit           _BIT_ACCESS(LATC,5)
// LATC<LATC6>
extern volatile __bit                   LATC6               __at(0x876);	// @ (0x10E * 8 + 6)
#define                                 LATC6_bit           _BIT_ACCESS(LATC,6)
// LATC<LATC7>
extern volatile __bit                   LATC7               __at(0x877);	// @ (0x10E * 8 + 7)
#define                                 LATC7_bit           _BIT_ACCESS(LATC,7)
// LATD<LATD0>
extern volatile __bit                   LATD0               __at(0x878);	// @ (0x10F * 8 + 0)
#define                                 LATD0_bit           _BIT_ACCESS(LATD,0)
// LATD<LATD1>
extern volatile __bit                   LATD1               __at(0x879);	// @ (0x10F * 8 + 1)
#define                                 LATD1_bit           _BIT_ACCESS(LATD,1)
// LATD<LATD2>
extern volatile __bit                   LATD2               __at(0x87A);	// @ (0x10F * 8 + 2)
#define                                 LATD2_bit           _BIT_ACCESS(LATD,2)
// LATD<LATD3>
extern volatile __bit                   LATD3               __at(0x87B);	// @ (0x10F * 8 + 3)
#define                                 LATD3_bit           _BIT_ACCESS(LATD,3)
// LATD<LATD4>
extern volatile __bit                   LATD4               __at(0x87C);	// @ (0x10F * 8 + 4)
#define                                 LATD4_bit           _BIT_ACCESS(LATD,4)
// LATD<LATD5>
extern volatile __bit                   LATD5               __at(0x87D);	// @ (0x10F * 8 + 5)
#define                                 LATD5_bit           _BIT_ACCESS(LATD,5)
// LATD<LATD6>
extern volatile __bit                   LATD6               __at(0x87E);	// @ (0x10F * 8 + 6)
#define                                 LATD6_bit           _BIT_ACCESS(LATD,6)
// LATD<LATD7>
extern volatile __bit                   LATD7               __at(0x87F);	// @ (0x10F * 8 + 7)
#define                                 LATD7_bit           _BIT_ACCESS(LATD,7)
// LATE<LATE0>
extern volatile __bit                   LATE0               __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 LATE0_bit           _BIT_ACCESS(LATE,0)
// LATE<LATE1>
extern volatile __bit                   LATE1               __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 LATE1_bit           _BIT_ACCESS(LATE,1)
// LATE<LATE2>
extern volatile __bit                   LATE2               __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 LATE2_bit           _BIT_ACCESS(LATE,2)
// ICDIO<LAT_ICDCLK>
extern volatile __bit                   LAT_ICDCLK          __at(0x7C64);	// @ (0xF8C * 8 + 4)
#define                                 LAT_ICDCLK_bit      _BIT_ACCESS(ICDIO,4)
// ICDIO<LAT_ICDDAT>
extern volatile __bit                   LAT_ICDDAT          __at(0x7C65);	// @ (0xF8C * 8 + 5)
#define                                 LAT_ICDDAT_bit      _BIT_ACCESS(ICDIO,5)
// OSCSTAT<LFIOFR>
extern volatile __bit                   LFIOFR              __at(0x4D1);	// @ (0x9A * 8 + 1)
