MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1567/mcu.h
extern volatile __bit                   TX11                __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 TX11_bit            _BIT_ACCESS(AD1TX0,1)
// AD1TX0<TX12>
extern volatile __bit                   TX12                __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 TX12_bit            _BIT_ACCESS(AD1TX0,2)
// AD1TX0<TX13>
extern volatile __bit                   TX13                __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 TX13_bit            _BIT_ACCESS(AD1TX0,3)
// AD1TX0<TX14>
extern volatile __bit                   TX14                __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 TX14_bit            _BIT_ACCESS(AD1TX0,4)
// AD1TX0<TX15>
extern volatile __bit                   TX15                __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 TX15_bit            _BIT_ACCESS(AD1TX0,5)
// AD1TX0<TX16>
extern volatile __bit                   TX16                __at(0x3496);	// @ (0x692 * 8 + 6)
#define                                 TX16_bit            _BIT_ACCESS(AD1TX0,6)
// AD1TX0<TX17>
extern volatile __bit                   TX17                __at(0x3497);	// @ (0x692 * 8 + 7)
#define                                 TX17_bit            _BIT_ACCESS(AD1TX0,7)
// AD1TX1<TX18>
extern volatile __bit                   TX18                __at(0x3498);	// @ (0x693 * 8 + 0)
#define                                 TX18_bit            _BIT_ACCESS(AD1TX1,0)
// AD1TX1<TX19>
extern volatile __bit                   TX19                __at(0x3499);	// @ (0x693 * 8 + 1)
#define                                 TX19_bit            _BIT_ACCESS(AD1TX1,1)
// AD1GRD<TX1POL>
extern volatile __bit                   TX1POL              __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 TX1POL_bit          _BIT_ACCESS(AD1GRD,0)
// AD2TX0<TX20>
extern volatile __bit                   TX20                __at(0x34A0);	// @ (0x694 * 8 + 0)
#define                                 TX20_bit            _BIT_ACCESS(AD2TX0,0)
// AD2TX0<TX21>
extern volatile __bit                   TX21                __at(0x34A1);	// @ (0x694 * 8 + 1)
#define                                 TX21_bit            _BIT_ACCESS(AD2TX0,1)
// AD2TX0<TX22>
extern volatile __bit                   TX22                __at(0x34A2);	// @ (0x694 * 8 + 2)
#define                                 TX22_bit            _BIT_ACCESS(AD2TX0,2)
// AD2TX0<TX23>
extern volatile __bit                   TX23                __at(0x34A3);	// @ (0x694 * 8 + 3)
#define                                 TX23_bit            _BIT_ACCESS(AD2TX0,3)
// AD2TX0<TX24>
extern volatile __bit                   TX24                __at(0x34A4);	// @ (0x694 * 8 + 4)
#define                                 TX24_bit            _BIT_ACCESS(AD2TX0,4)
// AD2TX0<TX25>
extern volatile __bit                   TX25                __at(0x34A5);	// @ (0x694 * 8 + 5)
#define                                 TX25_bit            _BIT_ACCESS(AD2TX0,5)
// AD2TX0<TX26>
extern volatile __bit                   TX26                __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 TX26_bit            _BIT_ACCESS(AD2TX0,6)
// AD2TX0<TX27>
extern volatile __bit                   TX27                __at(0x34A7);	// @ (0x694 * 8 + 7)
#define                                 TX27_bit            _BIT_ACCESS(AD2TX0,7)
// AD2TX1<TX28>
extern volatile __bit                   TX28                __at(0x34A8);	// @ (0x695 * 8 + 0)
#define                                 TX28_bit            _BIT_ACCESS(AD2TX1,0)
// AD2TX1<TX29>
extern volatile __bit                   TX29                __at(0x34A9);	// @ (0x695 * 8 + 1)
#define                                 TX29_bit            _BIT_ACCESS(AD2TX1,1)
// AD2GRD<TX2POL>
extern volatile __bit                   TX2POL              __at(0x3CC0);	// @ (0x798 * 8 + 0)
#define                                 TX2POL_bit          _BIT_ACCESS(AD2GRD,0)
// AD1TX1<TX30>
extern volatile __bit                   TX30                __at(0x349A);	// @ (0x693 * 8 + 2)
#define                                 TX30_bit            _BIT_ACCESS(AD1TX1,2)
// AD1TX1<TX31>
extern volatile __bit                   TX31                __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 TX31_bit            _BIT_ACCESS(AD1TX1,3)
// AD1TX1<TX32>
extern volatile __bit                   TX32                __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 TX32_bit            _BIT_ACCESS(AD1TX1,4)
// AD1TX1<TX33>
extern volatile __bit                   TX33                __at(0x349D);	// @ (0x693 * 8 + 5)
#define                                 TX33_bit            _BIT_ACCESS(AD1TX1,5)
// AD1TX1<TX34>
extern volatile __bit                   TX34                __at(0x349E);	// @ (0x693 * 8 + 6)
#define                                 TX34_bit            _BIT_ACCESS(AD1TX1,6)
// AD1TX1<TX35>
extern volatile __bit                   TX35                __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 TX35_bit            _BIT_ACCESS(AD1TX1,7)
// AD2TX1<TX40>
extern volatile __bit                   TX40                __at(0x34AA);	// @ (0x695 * 8 + 2)
#define                                 TX40_bit            _BIT_ACCESS(AD2TX1,2)
// AD2TX1<TX41>
extern volatile __bit                   TX41                __at(0x34AB);	// @ (0x695 * 8 + 3)
#define                                 TX41_bit            _BIT_ACCESS(AD2TX1,3)
// AD2TX1<TX42>
extern volatile __bit                   TX42                __at(0x34AC);	// @ (0x695 * 8 + 4)
#define                                 TX42_bit            _BIT_ACCESS(AD2TX1,4)
// AD2TX1<TX43>
extern volatile __bit                   TX43                __at(0x34AD);	// @ (0x695 * 8 + 5)
#define                                 TX43_bit            _BIT_ACCESS(AD2TX1,5)
// AD2TX1<TX44>
extern volatile __bit                   TX44                __at(0x34AE);	// @ (0x695 * 8 + 6)
#define                                 TX44_bit            _BIT_ACCESS(AD2TX1,6)
// AD2TX1<TX45>
extern volatile __bit                   TX45                __at(0x34AF);	// @ (0x695 * 8 + 7)
#define                                 TX45_bit            _BIT_ACCESS(AD2TX1,7)
// TXSTA<TX9>
extern volatile __bit                   TX9                 __at(0xCF6);	// @ (0x19E * 8 + 6)
#define                                 TX9_bit             _BIT_ACCESS(TXSTA,6)
// TXSTA<TX9D>
extern volatile __bit                   TX9D                __at(0xCF0);	// @ (0x19E * 8 + 0)
#define                                 TX9D_bit            _BIT_ACCESS(TXSTA,0)
// TXSTA<TXEN>
extern volatile __bit                   TXEN                __at(0xCF5);	// @ (0x19E * 8 + 5)
#define                                 TXEN_bit            _BIT_ACCESS(TXSTA,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x8C);	// @ (0x11 * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// ICDSTAT<USRHLTF>
extern volatile __bit                   USRHLTF             __at(0x7C89);	// @ (0xF91 * 8 + 1)
#define                                 USRHLTF_bit         _BIT_ACCESS(ICDSTAT,1)
// WDTCON<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x4B9);	// @ (0x97 * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON,1)
// WDTCON<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x4BA);	// @ (0x97 * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON,2)
// WDTCON<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x4BB);	// @ (0x97 * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON,3)
// WDTCON<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x4BC);	// @ (0x97 * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON,4)
// WDTCON<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON,5)
// WPUB<WPUB0>
extern volatile __bit                   WPUB0               __at(0x1068);	// @ (0x20D * 8 + 0)
#define                                 WPUB0_bit           _BIT_ACCESS(WPUB,0)
// WPUB<WPUB1>
extern volatile __bit                   WPUB1               __at(0x1069);	// @ (0x20D * 8 + 1)
#define                                 WPUB1_bit           _BIT_ACCESS(WPUB,1)
// WPUB<WPUB2>
extern volatile __bit                   WPUB2               __at(0x106A);	// @ (0x20D * 8 + 2)
#define                                 WPUB2_bit           _BIT_ACCESS(WPUB,2)
// WPUB<WPUB3>
extern volatile __bit                   WPUB3               __at(0x106B);	// @ (0x20D * 8 + 3)
#define                                 WPUB3_bit           _BIT_ACCESS(WPUB,3)
// WPUB<WPUB4>
extern volatile __bit                   WPUB4               __at(0x106C);	// @ (0x20D * 8 + 4)
#define                                 WPUB4_bit           _BIT_ACCESS(WPUB,4)
// WPUB<WPUB5>
extern volatile __bit                   WPUB5               __at(0x106D);	// @ (0x20D * 8 + 5)
#define                                 WPUB5_bit           _BIT_ACCESS(WPUB,5)
// WPUB<WPUB6>
extern volatile __bit                   WPUB6               __at(0x106E);	// @ (0x20D * 8 + 6)
#define                                 WPUB6_bit           _BIT_ACCESS(WPUB,6)
// WPUB<WPUB7>
extern volatile __bit                   WPUB7               __at(0x106F);	// @ (0x20D * 8 + 7)
#define                                 WPUB7_bit           _BIT_ACCESS(WPUB,7)
// WPUE<WPUE3>
extern volatile __bit                   WPUE3               __at(0x1083);	// @ (0x210 * 8 + 3)
#define                                 WPUE3_bit           _BIT_ACCESS(WPUE,3)
// PMCON1<WR>
extern volatile __bit                   WR                  __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(PMCON1,1)
// PMCON1<WREN>
extern volatile __bit                   WREN                __at(0xCAA);	// @ (0x195 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(PMCON1,2)
// PMCON1<WRERR>
extern volatile __bit                   WRERR               __at(0xCAB);	// @ (0x195 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(PMCON1,3)
// BAUDCON<WUE>
extern volatile __bit                   WUE                 __at(0xCF9);	// @ (0x19F * 8 + 1)
#define                                 WUE_bit             _BIT_ACCESS(BAUDCON,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// STATUS_SHAD<Z_SHAD>
extern volatile __bit                   Z_SHAD              __at(0x7F22);	// @ (0xFE4 * 8 + 2)
#define                                 Z_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,2)
// PCON<nBOR>
extern volatile __bit                   nBOR                __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON,0)
// STATUS<nPD>
extern volatile __bit                   nPD                 __at(0x1B);	// @ (0x3 * 8 + 3)
#define                                 nPD_bit             _BIT_ACCESS(STATUS,3)
// PCON<nPOR>
extern volatile __bit                   nPOR                __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON,1)
// PCON<nRI>
extern volatile __bit                   nRI                 __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON,2)
// PCON<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON,3)
// PCON<nRWDT>
extern volatile __bit                   nRWDT               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// STATUS<nTO>
extern volatile __bit                   nTO                 __at(0x1C);	// @ (0x3 * 8 + 4)
#define                                 nTO_bit             _BIT_ACCESS(STATUS,4)
// OPTION_REG<nWPUEN>
extern volatile __bit                   nWPUEN              __at(0x4AF);	// @ (0x95 * 8 + 7)
#define                                 nWPUEN_bit          _BIT_ACCESS(OPTION_REG,7)

#endif // _PIC16LF1567_H_
